SpeechsterInnovations/Speechster_ESP32-H2-Testing/Speechster-ESP32-S3-PR1/Main-Working/main/main.c
// ─────────────────────────────────────────────
// Speechster-B1 v1.6 RELEASE CANDIDATE
// Nov 2025 — "The one that might actually work"
// Safe aggregation, adaptive BLE pacing, heap-based buffers
// Built for ESP32-S3-DevKitC-1-N8R2 ESP32-S3 WiFi Bluetooth-Compatible BLE 5.0 Mesh Development Board
// ─────────────────────────────────────────────

#include <stdio.h>
#include <string.h>
#include <stdint.h>
#include <stdbool.h>
#include <stdlib.h>
#include <inttypes.h>

#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "freertos/ringbuf.h"
#include "freertos/semphr.h"
#include "freertos/portmacro.h"
#include "esp_heap_trace.h"
#include <math.h>

#include "esp_log.h"
#include "esp_timer.h"
#include "freertos/portable.h"
#include "esp_system.h"
#include "esp_rom_sys.h"
#include "nvs_flash.h"
#include <stdatomic.h>
#include "esp_task_wdt.h"
#include "esp_heap_caps.h"
#include "esp_intr_alloc.h"
#include "esp_cache.h"

#include "driver/i2s_std.h"
#include "esp_adc/adc_continuous.h"
#include "esp_adc/adc_cali.h"
#include "esp_adc/adc_cali_scheme.h"
#include "hal/adc_types.h" 
#include "driver/gpio.h"

/* NimBLE / BLE includes */
#include "nimble/nimble_port.h"
#include "nimble/nimble_port_freertos.h"
#include "host/ble_hs.h"
#include "host/ble_uuid.h"
#include "host/ble_gap.h"
#include "host/ble_gatt.h"
#include "services/gap/ble_svc_gap.h"
#include "services/gatt/ble_svc_gatt.h"
#include "host/ble_att.h"
#include "esp_bt.h"

/* JSON parsing */
#include "cJSON.h"

/* WiFi Includes */
#include "esp_wifi.h"
#include "esp_event.h"
#include "esp_netif.h"
#include "esp_http_server.h"
#include "freertos/semphr.h"
#include "esp_websocket_client.h"
#include "esp_https_ota.h"
#include "esp_http_client.h"

// PM
#include "driver/temperature_sensor.h"   // on-chip temp sensor (ESP32-S3)
#include "esp_sleep.h"

#ifdef CONFIG_PM_ENABLE
#include "esp_pm.h"
#endif

/* Brownout Protection (To prevent huge WiFi/BLE bursts) */
#include "soc/soc_caps.h"
#include "esp_err.h"

static const char *TAG = "speechster_b1";

/* ---------- Defaults & config ---------- */
#define UART_BAUD_RATE       115200
#define AUDIO_SAMPLE_RATE    16000
#define AUDIO_FRAME_MS       10
#define AUDIO_FRAME_SAMPLES   ((AUDIO_SAMPLE_RATE / 1000) * AUDIO_FRAME_MS)  // 960 at 48kHz
#define AUDIO_BYTES_PER_SAMPLE 2
#define AUDIO_READ_BYTES     (AUDIO_FRAME_SAMPLES * AUDIO_BYTES_PER_SAMPLE)
#define AUDIO_RINGBUF_SIZE   (48 * 1024)
#define STREAM_SLICE_MAX   (8 * 1024) // Smaller slice size reduces total number of chunks per logical frame
#define I2S_BUF_SIZE 2048
#define AGGREGATE_BYTES  (15 * 320)
#define LOG_CTRL(fmt, ...) ESP_LOGI(TAG, "[CTRL_IN] " fmt, ##__VA_ARGS__)
#define LOG_JSON_PARSE(fmt, ...) ESP_LOGI(TAG, "[JSON_PARSE] " fmt, ##__VA_ARGS__)
#define HEAP_TRACE_RECORDS 256

/* ---------- Heap-safe pre-allocated buffers ---------- */
#define FRAMES_PER_BATCH     10  // 10 × 10 ms = 100 ms audio batch
#define MAX_BATCH_PCM_BYTES  ( ((AUDIO_SAMPLE_RATE/1000) * AUDIO_FRAME_MS) * sizeof(int16_t) * FRAMES_PER_BATCH )
#define MAX_FRAME_SIZE       (8 + MAX_BATCH_PCM_BYTES)
static uint8_t audio_frame_buf[MAX_FRAME_SIZE];

static i2s_chan_handle_t rx_chan = NULL; 
static uint32_t rb_overflow_count = 0;
static uint32_t ble_delay_ms = 10;

#define I2S_PORT_NUM         I2S_NUM_0
#define I2S_BCK_IO           19   // SCK
#define I2S_WS_IO            20   // WS / LRCLK
#define I2S_DATA_IN_IO       21   // SD (data from mic)
#define SAMPLE_BUF_LEN       320  // Number of samples per read

// Top-level globals
static int32_t *i2s_dma_buf = NULL;
static adc_continuous_handle_t adc_handle = NULL;
static QueueHandle_t adc_evt_queue = NULL;
static bool adc_running = false;

static temperature_sensor_handle_t temp_sensor_handle = NULL;
static float current_temp_c = 0.0f;

typedef enum {
    WS_ACTION_NONE = 0,
    WS_ACTION_STOP_CTRL,
    WS_ACTION_DESTROY_CTRL,
    WS_ACTION_STOP_AUDIO,
    WS_ACTION_DESTROY_AUDIO,
} ws_action_t;

static QueueHandle_t ws_mgr_q = NULL;


/* PM config (tunable) */
#ifndef SPEECHSTER_PM_MAX_MHZ
#define SPEECHSTER_PM_MAX_MHZ 160
#endif
#ifndef SPEECHSTER_PM_MIN_MHZ
#define SPEECHSTER_PM_MIN_MHZ 80
#endif

/* Thermal thresholds (adjust to your enclosure / testing) */
#define THERMAL_WARN_C   70.0f   // throttling threshold
#define THERMAL_CRIT_C   80.0f   // emergency stop threshold

// FSR Stuff
#define ADC_UNIT            ADC_UNIT_1
#define ADC_ATTEN           ADC_ATTEN_DB_12
#define ADC_BIT_WIDTH       SOC_ADC_DIGI_MAX_BITWIDTH
#define ADC_READ_LEN        256   // bytes per read (tune as needed)
#define ADC_CONV_MODE       ADC_CONV_SINGLE_UNIT_1
#define ADC_OUTPUT_TYPE     ADC_DIGI_OUTPUT_FORMAT_TYPE2
#define FSR_ADC_CHANNEL ADC_CHANNEL_6
#define CONSERVATIVE_LL_OCTETS 220
static uint32_t fsr_interval_ms = 50; // default 50ms, can be changed via JSON

/* Packet framing (8 byte header):
 * 0: type (0x01 audio, 0x02 sensor)
 * 1: flags (reserved, currently always 0x00)
 * 2-3: seq (uint16 little-endian)
 * 4-7: ts_ms (uint32 little-endian)
 * 5: Payload
 */
static inline void pack_header(uint8_t *buf, uint8_t type, uint8_t flags, uint16_t seq, uint32_t ts_ms) {
    buf[0] = type;
    buf[1] = flags;
    buf[2] = seq & 0xff;
    buf[3] = (seq >> 8) & 0xff;
    buf[4] = ts_ms & 0xff;
    buf[5] = (ts_ms >> 8) & 0xff;
    buf[6] = (ts_ms >> 16) & 0xff;
    buf[7] = (ts_ms >> 24) & 0xff;
}

typedef struct {
    char ssid[32];
    char pass[64];
    char ip[32];
    char port[16];
} wifi_creds_t;

/* ---------- 16-bit additive checksum ---------- */
static __attribute__((unused)) uint16_t calc_checksum16(const uint8_t *data, size_t len) {
    uint32_t sum = 0;
    for (size_t i = 0; i < len; i++) sum += data[i];
    // Fold to 16 bits and wrap carry
    while (sum >> 16)
        sum = (sum & 0xFFFF) + (sum >> 16);
    return (uint16_t)sum;
}


/* Runtime State */
static const uint8_t AUDIO_FLAG_PCM = 0x00;
static volatile bool pSensor_enabled = false;
static uint32_t seq_counter = 0;
static volatile uint64_t idle_ticks = 0;
static SemaphoreHandle_t ringbuf_mutex = NULL; // Protects ringbuffer access without disabling interrupts
static atomic_bool wifi_connected = ATOMIC_VAR_INIT(false);
static atomic_bool ws_ctrl_connected = ATOMIC_VAR_INIT(false);
static atomic_bool ws_audio_connected = ATOMIC_VAR_INIT(false);
static atomic_bool wifi_wdt_active = ATOMIC_VAR_INIT(false);
static uint32_t frames_dropped = 0;

// new: request that capture task deinit i2s channel
static atomic_bool i2s_deinit_requested = ATOMIC_VAR_INIT(false);
// and small helper to test if rx_chan exists atomically
static inline bool rx_chan_ready(void) {
    return rx_chan != NULL;
}


/* Set true once esp_wifi_start() returned ESP_OK (soft indicator) */
static volatile bool wifi_stack_started = false;
static void wifi_event_handler(void *arg, esp_event_base_t event_base, int32_t event_id, void *event_data);

// Forward declarations
static int send_chunked_notify(uint16_t conn_handle,
                               uint16_t attr_handle,
                               const uint8_t *frame,
                               size_t frame_len);

static bool start_mic_streaming(void);
static void stop_mic_streaming(void);
void perform_ota_update(void *pvParameters);
static void ble_send_json_response(const char *json_str);
static float read_temperature_c(void);
void ble_on_wifi_creds_received(const char *json_str);
static esp_netif_t* ensure_sta_netif(void);

/* ------------------- WiFi Config ------------------- */
static const char *WIFI_TAG = "WiFiSend";

// Dynamic server URIs — filled at runtime from BLE credentials or NVS
static char WS_CTRL_URI[128]  = {0};   // ws://<host>:<port>/ws    (control + telemetry)
static char WS_AUDIO_URI[128] = {0};   // ws://<host>:<port>/data/audio  (binary audio)
static char OTA_URL[128]      = {0};
static char TELEMETRY_URL[128]= {0};

// Two websocket clients: control and audio
static esp_websocket_client_handle_t ws_client_ctrl  = NULL;
static esp_websocket_client_handle_t ws_client_audio = NULL;

// Per-client connected flags
static esp_http_client_handle_t wifi_http_client = NULL;

