SpeechsterInnovations/Speechster_ESP32-H2-Testing/Speechster-ESP32-S3-PR1/Main-Working/main/main.c
// ─────────────────────────────────────────────
// Wi-Fi frame send queue (decoupled from I2S task)
// ─────────────────────────────────────────────
#define WIFI_SEND_QUEUE_LEN 64

typedef struct {
    size_t len;
    uint8_t *data;  // dynamically allocated buffer
} wifi_frame_t;

static QueueHandle_t wifi_send_q = NULL;

// Allocate safe frame object
static wifi_frame_t *alloc_wifi_frame(size_t len) {
    wifi_frame_t *f = heap_caps_malloc(sizeof(wifi_frame_t), MALLOC_CAP_INTERNAL);
    if (!f) return NULL;
    f->data = heap_caps_malloc(len, MALLOC_CAP_INTERNAL);
    if (!f->data) {
        free(f);
        return NULL;
    }
    f->len = len;
    return f;
}

static void free_wifi_frame(wifi_frame_t *f) {
    if (!f) return;
    if (f->data) free(f->data);
    free(f);
}

static void wifi_init_task(void *pv) {

    ESP_LOGI("WiFiTask", "wifi_init_task() running...");

    wifi_creds_t creds;
    if (!pv) {
        vTaskDelete(NULL);
        return;
    }
    // If called with direct creds pointer, use it and free if needed
    memcpy(&creds, pv, sizeof(creds));
    // if pv came from heap, free it here (not used in this sample)

    // *** Do the full wifi init here. Robust logging at each step. ***
    ESP_LOGI("WiFiTask", "Starting wifi_init_sta task for SSID='%s'", creds.ssid);

    esp_err_t err;
    err = esp_netif_init();
    if (err != ESP_OK) {
        ESP_LOGE("WiFiTask", "esp_netif_init failed: %s", esp_err_to_name(err));
        goto done;
    }

    err = esp_event_loop_create_default();
    if (err != ESP_OK && err != ESP_ERR_INVALID_STATE) {
        ESP_LOGE("WiFiTask", "esp_event_loop_create_default failed: %s", esp_err_to_name(err));
        goto done;
    }

    esp_netif_t *sta_netif = ensure_sta_netif();
    if (!sta_netif) {
        ESP_LOGE("WiFiTask", "ensure_sta_netif returned NULL");
        goto done;
    }

    wifi_init_config_t cfg = WIFI_INIT_CONFIG_DEFAULT();
    err = esp_wifi_init(&cfg);
    if (err != ESP_OK) {
        ESP_LOGE("WiFiTask", "esp_wifi_init failed: %s", esp_err_to_name(err));
        goto done;
    }

    err = esp_event_handler_register(WIFI_EVENT, ESP_EVENT_ANY_ID, &wifi_event_handler, NULL);
    if (err != ESP_OK) {
        ESP_LOGE("WiFiTask", "esp_event_handler_register(WIFI_EVENT) failed: %s", esp_err_to_name(err));
        goto done;
    }
    err = esp_event_handler_register(IP_EVENT, IP_EVENT_STA_GOT_IP, &wifi_event_handler, NULL);
    if (err != ESP_OK) {
        ESP_LOGE("WiFiTask", "esp_event_handler_register(IP_EVENT) failed: %s", esp_err_to_name(err));
        goto done;
    }

    wifi_config_t wifi_config = {0};
    strncpy((char *)wifi_config.sta.ssid, creds.ssid, sizeof(wifi_config.sta.ssid)-1);
    strncpy((char *)wifi_config.sta.password, creds.pass, sizeof(wifi_config.sta.password)-1);

    err = esp_wifi_set_mode(WIFI_MODE_STA);
    if (err != ESP_OK) {
        ESP_LOGE("WiFiTask", "esp_wifi_set_mode failed: %s", esp_err_to_name(err));
        goto done;
    }
    err = esp_wifi_set_config(WIFI_IF_STA, &wifi_config);
    if (err != ESP_OK) {
        ESP_LOGE("WiFiTask", "esp_wifi_set_config failed: %s", esp_err_to_name(err));
        goto done;
    }

    err = esp_wifi_start();
    if (err != ESP_OK) {
        ESP_LOGE("WiFiTask", "esp_wifi_start failed: %s", esp_err_to_name(err));
        goto done;
    }
    wifi_stack_started = true;
    ESP_LOGI("WiFiTask", "esp_wifi_start OK");

done:
    // free the heap credentials passed in by caller (if any)
    if (pv) {
        free(pv);
    }

    esp_wifi_set_max_tx_power(40);  // 40 * 0.25dBm = 10 dBm (~10mW)

    // one-shot task; exit
    vTaskDelete(NULL);

}


#ifndef MIN
#define MIN(a,b) ((a) < (b) ? (a) : (b))
#endif
#ifndef MAX
#define MAX(a,b) ((a) > (b) ? (a) : (b))
#endif

static SemaphoreHandle_t state_lock = NULL;

/* BLE state */
static uint16_t g_conn_handle = 0;
static uint16_t g_stream_attr_handle = 0; // populated on subscribe
static volatile bool fake_mode = false; // start with fake frames disabled

/* Control command queue for deferred JSON parsing */
#define CTRL_QUEUE_LEN 8
typedef struct {
    size_t len;
    char *json;
} control_msg_t;
static QueueHandle_t ctrl_queue = NULL;

// ======== Concurrency Flags ========
static atomic_bool mic_active = ATOMIC_VAR_INIT(false);
static atomic_bool bt_conn = ATOMIC_VAR_INIT(false);
static atomic_bool streaming = ATOMIC_VAR_INIT(false);

// ======== BLE Sender Backoff State ========
static uint32_t ble_backoff_ms = 5;

// ======== Health Monitoring ========
static uint32_t frames_sent = 0;

static adc_cali_handle_t adc_cali_handle = NULL;

static __attribute__((unused)) void adc_cali_init(void) {
    adc_cali_curve_fitting_config_t cali_cfg = {
        .unit_id = ADC_UNIT_1,
        .atten = ADC_ATTEN_DB_12,
        .bitwidth = SOC_ADC_DIGI_MAX_BITWIDTH,
    };
    if (adc_cali_create_scheme_curve_fitting(&cali_cfg, &adc_cali_handle) == ESP_OK) {
        ESP_LOGI("ADC_CALI", "Calibration enabled");
    } else {
        ESP_LOGW("ADC_CALI", "Calibration not supported on this chip");
    }
}

/* ---- ADC ISR callback ---- */
static bool adc_conv_done_cb(adc_continuous_handle_t handle,
                             const adc_continuous_evt_data_t *edata,
                             void *user_data)
{
    BaseType_t mustYield = pdFALSE;

    if (adc_evt_queue) {
        /* try to push the event size into the queue; count drops */
        if (xQueueSendFromISR(adc_evt_queue, &edata->size, &mustYield) != pdTRUE) {
            /* Track dropped ADC events for telemetry */
            rb_overflow_count++;
        }
    }

    /* Return true if a context switch is required */
    return mustYield;
}


/* ---------- Helper: ensure default STA netif (avoid double create) ---------- */
static esp_netif_t* ensure_sta_netif(void)
{
    // The default ifkey name used by esp-netif for STA is "WIFI_STA_DEF"
    esp_netif_t *netif = esp_netif_get_handle_from_ifkey("WIFI_STA_DEF");
    if (netif) {
        ESP_LOGI("WiFi", "Default STA netif already exists -> reusing");
        return netif;
    }

    netif = esp_netif_create_default_wifi_sta();
    if (!netif) {
        ESP_LOGE("WiFi", "esp_netif_create_default_wifi_sta returned NULL");
    } else {
        ESP_LOGI("WiFi", "Created default STA netif");
    }
    return netif;
}

/* Small task to reconfigure Wi-Fi when stack is already started.
 * Argument: pointer to heap-allocated wifi_creds_t (freed here)
 */
static void wifi_reconfigure_task(void *pv)
{
    wifi_creds_t *creds = (wifi_creds_t *)pv;
    if (!creds) vTaskDelete(NULL);

    wifi_mode_t mode;
    wifi_config_t current_conf;
    esp_wifi_get_mode(&mode);
    esp_wifi_get_config(WIFI_IF_STA, &current_conf);

    // Compare new creds against currently configured SSID
    if (strcmp((char *)current_conf.sta.ssid, creds->ssid) == 0) {
        ESP_LOGW("WiFiCFG", "Already connected to the same network — skipping reconfig");
        free(creds);
        vTaskDelete(NULL);
        return;
    }

    ESP_LOGI("WiFi", "Reconfiguring Wi-Fi with new creds (safe path)");

