SpeechsterInnovations/Speechster_ESP32-H2-Testing/Speechster-ESP32-S3-PR1/Main-Working/main/main.c
    // If driver not initialized, bail (caller should create wifi_init_task instead)
    if (esp_wifi_get_mode(&mode) == ESP_ERR_WIFI_NOT_INIT) {
        ESP_LOGW("WiFi", "esp_wifi not initialized; cannot reconfigure");
        free(creds);
        vTaskDelete(NULL);
        return;
    }


    ESP_LOGI("WiFi", "Reconfiguring Wi-Fi with new creds (safe path)");
    // If driver not initialized, bail (caller should create wifi_init_task instead)
    if (esp_wifi_get_mode(&mode) == ESP_ERR_WIFI_NOT_INIT) {
        ESP_LOGW("WiFi", "esp_wifi not initialized; cannot reconfigure");
        free(creds);
        vTaskDelete(NULL);
        return;
    }

    wifi_config_t wifi_config = {0};
    strncpy((char *)wifi_config.sta.ssid, creds->ssid, sizeof(wifi_config.sta.ssid)-1);
    strncpy((char *)wifi_config.sta.password, creds->pass, sizeof(wifi_config.sta.password)-1);

    ESP_LOGI("WiFi", "Reconfiguring Wi-Fi — restarting driver to ensure clean state");

    // Force stop/start (safe even if already running)
    esp_wifi_disconnect();
    vTaskDelay(pdMS_TO_TICKS(200));
    esp_wifi_stop();

    while (esp_wifi_stop() == ESP_ERR_WIFI_NOT_INIT) {
        vTaskDelay(pdMS_TO_TICKS(100));
    }



    vTaskDelay(pdMS_TO_TICKS(300));

    esp_err_t rc = esp_wifi_start();
    if (rc == ESP_OK) {
        ESP_LOGI("WiFi", "esp_wifi_start after reconfig OK");
        vTaskDelay(pdMS_TO_TICKS(200));
        esp_wifi_set_config(WIFI_IF_STA, &wifi_config);
        esp_wifi_connect();
    } else {
        ESP_LOGE("WiFi", "esp_wifi_start failed after reconfig: %s", esp_err_to_name(rc));
    }


    free(creds);
    vTaskDelete(NULL);
}


static void adc_start(void)
{
    if (adc_running) {
        ESP_LOGW("ADC_CONT", "ADC already running");
        return;
    }

    if (!adc_handle) {
        adc_evt_queue = xQueueCreate(8, sizeof(uint32_t));

        adc_continuous_handle_cfg_t handle_cfg = {
            .max_store_buf_size = 1024,
            .conv_frame_size = ADC_READ_LEN,
        };
        ESP_ERROR_CHECK(adc_continuous_new_handle(&handle_cfg, &adc_handle));

        // ADC pattern setup
        static adc_digi_pattern_config_t adc_pattern[1];
        adc_pattern[0].atten      = ADC_ATTEN_DB_12;
        adc_pattern[0].channel    = FSR_ADC_CHANNEL;
        adc_pattern[0].unit       = ADC_UNIT_1;
        adc_pattern[0].bit_width  = SOC_ADC_DIGI_MAX_BITWIDTH;

        adc_continuous_config_t dig_cfg = {
            .sample_freq_hz = 1000,
            .conv_mode      = ADC_CONV_SINGLE_UNIT_1,
            .format         = ADC_DIGI_OUTPUT_FORMAT_TYPE2,
            .adc_pattern    = adc_pattern,
            .pattern_num    = 1,
        };

        ESP_ERROR_CHECK(adc_continuous_config(adc_handle, &dig_cfg));

        adc_continuous_evt_cbs_t cbs = {
            .on_conv_done = adc_conv_done_cb,
        };
        ESP_ERROR_CHECK(adc_continuous_register_event_callbacks(adc_handle, &cbs, NULL));
    }

    ESP_ERROR_CHECK(adc_continuous_start(adc_handle));
    adc_running = true;
    ESP_LOGI("ADC_CONT", "ADC started (continuous mode)");
}

static void adc_stop(void)
{
    if (!adc_running || !adc_handle) return;
    ESP_ERROR_CHECK(adc_continuous_stop(adc_handle));
    adc_running = false;
    ESP_LOGI("ADC_CONT", "ADC stopped");
}

static TaskHandle_t i2s_task_handle = NULL;

// Notify wrappers (safe from any context)
static inline void notify_i2s_start(void) {
    if (i2s_task_handle) xTaskNotifyGive(i2s_task_handle);
}

static inline void notify_i2s_stop(void) {
    if (i2s_task_handle) {
        xTaskNotify(i2s_task_handle, 1, eSetBits);  // optional flag
    }
}

static void dynamic_pm_task(void *arg)
{
#ifdef CONFIG_PM_ENABLE
    const int FAST = SPEECHSTER_PM_MAX_MHZ;
    const int SLOW = SPEECHSTER_PM_MIN_MHZ;
    /* Start in low-power idle mode; go FAST when busy */
    int current = SLOW;
    
    while (1) {
        bool busy = atomic_load(&mic_active) || atomic_load(&streaming) ||
                    atomic_load(&bt_conn) || atomic_load(&ws_audio_connected);

        int target = busy ? FAST : SLOW;
        if (target != current) {
            esp_pm_config_t cfg = {
                .max_freq_mhz = target,
                .min_freq_mhz = SLOW,
                .light_sleep_enable = true
            };
            esp_err_t rc = esp_pm_configure(&cfg);
            if (rc == ESP_OK) {
                current = target;
                ESP_LOGI("PM_ADAPT", "CPU freq -> %d MHz (%s mode)",
                         target, busy ? "active" : "idle");
            }
        }

        vTaskDelay(pdMS_TO_TICKS(5000));
    }
#else
    vTaskDelete(NULL);
#endif
}


/* ---------- I2S (INMP441) ---------- */
static void i2s_init_inmp441(void)
{
    esp_err_t rc;

    /* If a channel exists, leave it to caller to destroy — here we try to be idempotent */
    if (rx_chan) {
        ESP_LOGI("I2S", "rx_chan already present — skipping new_channel");
        return;
    }

    i2s_chan_config_t chan_cfg = I2S_CHANNEL_DEFAULT_CONFIG(I2S_PORT_NUM, I2S_ROLE_MASTER);
    chan_cfg.auto_clear = true;
    chan_cfg.id = I2S_PORT_NUM;

    rc = i2s_new_channel(&chan_cfg, NULL, &rx_chan);
    if (rc != ESP_OK) {
        ESP_LOGE("I2S", "i2s_new_channel failed: %s", esp_err_to_name(rc));
        rx_chan = NULL;
        return;
    }

    /* Standard (PDM/PCM-style) std config tuned for INMP441:
     * - 16 kHz sample_rate (AUDIO_SAMPLE_RATE)
     * - 32-bit slots (INMP441 gives 24 useful bits in a 32-bit slot)
     * - mono left (L/R tied to GND => left)
     */
    i2s_std_config_t std_cfg = {
        .clk_cfg = {
            .sample_rate_hz = AUDIO_SAMPLE_RATE,
            .clk_src = I2S_CLK_SRC_DEFAULT,
            .mclk_multiple = I2S_MCLK_MULTIPLE_256,
        },
        .slot_cfg = {
            .data_bit_width = I2S_DATA_BIT_WIDTH_32BIT,
            .slot_bit_width = I2S_SLOT_BIT_WIDTH_32BIT,
            .slot_mode = I2S_SLOT_MODE_MONO,
            .slot_mask = I2S_STD_SLOT_LEFT,      // left channel (LR tied low)
            .ws_width = I2S_DATA_BIT_WIDTH_32BIT,
            .ws_pol = false,
            .bit_shift = true,
        },
        .gpio_cfg = {
            .mclk = I2S_GPIO_UNUSED,
            .bclk = I2S_BCK_IO,
            .ws   = I2S_WS_IO,
            .dout = I2S_GPIO_UNUSED,
            .din  = I2S_DATA_IN_IO,
        },
    };

    rc = i2s_channel_init_std_mode(rx_chan, &std_cfg);
    if (rc != ESP_OK) {
        ESP_LOGE("I2S", "i2s_channel_init_std_mode failed: %s", esp_err_to_name(rc));
        if (rx_chan) {
            i2s_del_channel(rx_chan);
            rx_chan = NULL;
        }
        return;
    }

    /* small settle time for WS/BCLK lines */
    vTaskDelay(pdMS_TO_TICKS(30));

    rc = i2s_channel_enable(rx_chan);
    if (rc != ESP_OK) {
        ESP_LOGE("I2S", "i2s_channel_enable failed: %s", esp_err_to_name(rc));
        i2s_del_channel(rx_chan);
        rx_chan = NULL;
        return;
    }

