SpeechsterInnovations/Speechster_ESP32-H2-Testing/Speechster-ESP32-S3-PR1/Main-Working/main/main.c
    ESP_LOGI("I2S_DBG", "Pin levels: BCK=%d WS=%d DIN=%d",
    gpio_get_level(I2S_BCK_IO),
    gpio_get_level(I2S_WS_IO),
    gpio_get_level(I2S_DATA_IN_IO));


    ESP_LOGI("I2S", "INMP441 initialized and enabled (%u Hz, 32-bit mono left)", AUDIO_SAMPLE_RATE);
}

// ─────────────────────────────────────────────
// Unified JSON control handler
// ─────────────────────────────────────────────
static void handle_control_json(cJSON *root) {
    if (!root) return;

    // BLE priority: if BLE is connected, ignore WebSocket unless BLE is idle
    if (atomic_load(&bt_conn)) {
        ESP_LOGI(TAG, "BLE connected — BLE commands take priority.");
    } else if (atomic_load(&ws_ctrl_connected)) {
        ESP_LOGI(TAG, "No BLE connection — accepting WebSocket command.");
    } else {
        ESP_LOGW(TAG, "No control channel active; ignoring JSON command.");
        return;
    }

    xSemaphoreTake(state_lock, portMAX_DELAY);

    // Detect BLE Wi-Fi credentials JSON (ssid+pass+host_ip+host_port)
    cJSON *j_ssid = cJSON_GetObjectItem(root, "ssid");
    cJSON *j_pass = cJSON_GetObjectItem(root, "pass");
    cJSON *j_ip   = cJSON_GetObjectItem(root, "host_ip");
    cJSON *j_port = cJSON_GetObjectItem(root, "host_port");

    if (j_ssid && j_pass && j_ip && j_port &&
        cJSON_IsString(j_ssid) && cJSON_IsString(j_pass) &&
        cJSON_IsString(j_ip) && cJSON_IsString(j_port)) {
        char *json_str = cJSON_PrintUnformatted(root);
        if (json_str) {
            ESP_LOGI("CTRL_JSON", "Detected Wi-Fi creds JSON, forwarding to BLE_CFG handler");
            xSemaphoreGive(state_lock);         // <-- release before calling out
            ble_on_wifi_creds_received(json_str);
            free(json_str);
        } else {
            xSemaphoreGive(state_lock);         // ensure we don't keep lock if Print failed
        }
        return; // stop further handling
    }


    cJSON *jmic = cJSON_GetObjectItem(root, "mic");
    if (jmic && cJSON_IsBool(jmic)) {
        if (cJSON_IsTrue(jmic)) {
            vTaskDelay(pdMS_TO_TICKS(300));
            start_mic_streaming();
            vTaskDelay(pdMS_TO_TICKS(10)); // let scheduler breathe
        } else {
            stop_mic_streaming();
        }
        LOG_JSON_PARSE("mic=%d", (int)atomic_load(&mic_active));
    }

    cJSON *jpSensor = cJSON_GetObjectItem(root, "pSensor");
    if (jpSensor && cJSON_IsBool(jpSensor)) {
        bool new_state = cJSON_IsTrue(jpSensor);
        if (new_state != pSensor_enabled) {
            pSensor_enabled = new_state;
            LOG_JSON_PARSE("pSensor=%d", pSensor_enabled);

            if (pSensor_enabled) {
                adc_start();
            } else {
                adc_stop();
            }
        }
    }

    cJSON *jdelay = cJSON_GetObjectItem(root, "ble_delay_ms");
    if (jdelay && cJSON_IsNumber(jdelay)) {
        uint32_t v = (uint32_t) jdelay->valuedouble;
        if (v >= 5 && v <= 200) {
            ble_delay_ms = v;
            LOG_JSON_PARSE("ble_delay_ms=%u", ble_delay_ms);
        }
    }

    cJSON *jcmd = cJSON_GetObjectItem(root, "cmd");
    if (jcmd && cJSON_IsString(jcmd)) {
        const char *cmd = jcmd->valuestring;
        if (strcmp(cmd, "OTA_UPDATE") == 0) {
            xTaskCreate(&perform_ota_update, "ota_task", 8192, NULL, 5, NULL);
        }
    }

    xSemaphoreGive(state_lock);
}


void mic_test_task_debug(void *param) {
    atomic_store(&mic_active, true);

    int32_t buf[256];
    size_t bytes_read = 0;
    ESP_LOGI(TAG, "Starting mic test task...");

    esp_err_t e = i2s_channel_enable(rx_chan);
    if (e != ESP_OK) {
        ESP_LOGE(TAG, "Failed to enable I2S RX channel: %s", esp_err_to_name(e));
    } else {
        ESP_LOGI(TAG, "RX channel enabled for mic test");
    }


    while (1) {

    if (!rx_chan) {
        ESP_LOGW("DBG", "rx_chan not ready yet, waiting...");
        vTaskDelay(pdMS_TO_TICKS(500));
        continue;
    }


        esp_err_t ret = i2s_channel_read(rx_chan, buf, sizeof(buf), &bytes_read, portMAX_DELAY);
        if (ret == ESP_OK && bytes_read > 0) {
            size_t samples = bytes_read / sizeof(int32_t);
            int32_t avg = 0;
            for (size_t i = 0; i < samples; i++) avg += (buf[i] >> 14);
            avg /= samples;
            ESP_LOGI(TAG, "Mic avg raw: %ld", avg);
        } else {
            ESP_LOGW(TAG, "I2S read failed: %d", ret);
        }

        vTaskDelay(pdMS_TO_TICKS(100));
    }
}

// NOTE: call this ONLY from i2s_capture_task context.
static void i2s_del_channel_from_capture(void)
{
    if (rx_chan) {
        ESP_LOGI("I2S", "Capture task performing i2s del channel");
        // try to disable the channel first (safe if already disabled)
        esp_err_t rc = i2s_channel_disable(rx_chan);
        if (rc != ESP_OK && rc != ESP_ERR_INVALID_STATE) {
            ESP_LOGW("I2S", "i2s_channel_disable rc=%s", esp_err_to_name(rc));
        }
        i2s_del_channel(rx_chan);
        rx_chan = NULL;
    }
}


static bool start_mic_streaming(void) {
    bool expected = false;
    if (!atomic_compare_exchange_strong(&mic_active, &expected, true)) {
        ESP_LOGW(TAG, "Mic already active");
        return false;
    }

    ESP_LOGI(TAG, "Starting mic streaming...");
    atomic_store(&streaming, true);
    atomic_store(&i2s_deinit_requested, false);

    // Always recreate RX channel fresh
    if (rx_chan) {
        ESP_LOGW(TAG, "Destroying stale I2S channel before reinit");
        i2s_channel_disable(rx_chan);
        i2s_del_channel(rx_chan);
        rx_chan = NULL;
    }

    if (rx_chan && !atomic_load(&i2s_deinit_requested)) {
        ESP_LOGI(TAG, "Reusing existing I2S channel");
    } else {
        i2s_init_inmp441();
    }

    if (!rx_chan) {
        ESP_LOGE(TAG, "I2S init failed; aborting mic start");
        atomic_store(&mic_active, false);
        return false;
    }

    // Channel is ready to go
    notify_i2s_start();
    return true;
}

static void stop_mic_streaming(void) {
    ESP_LOGI(TAG, "Stopping mic streaming...");
    atomic_store(&streaming, false);
    atomic_store(&mic_active, false);

    // Request capture task to stop cleanly and deinit the I2S channel when safe.
    atomic_store(&i2s_deinit_requested, true);
    notify_i2s_stop();

