SpeechsterInnovations/Speechster_ESP32-H2-Testing/Speechster-ESP32-S3-PR1/Main-Working/main/main.c
    // Optional: wait briefly for i2s_capture_task to complete its shutdown.
    // Do not block too long in case this is called from BLE context; use short timeout.
    for (int i = 0; i < 50; ++i) { // ~50 * 10 ms = 500 ms max
        if (!rx_chan) break; // capture task finished and cleared rx_chan
        vTaskDelay(pdMS_TO_TICKS(10));
    }
    if (rx_chan) {
        ESP_LOGW("I2S", "stop_mic_streaming timeout waiting for capture task to deinit; leaving rx_chan (it will be cleaned later)");
    } else {
        ESP_LOGI("I2S", "I2S channel deinitialized cleanly");
    }
}


/* Recommended replacement wifi_send_task with safer sends and better logging */
static void wifi_send_task(void *arg)
{
    wifi_frame_t *frame = NULL;

    ESP_LOGI("WiFiSendTask", "Wi-Fi sender task started (improved)");

    const size_t WS_SEND_CHUNK = 1024;      // send in 1 KiB chunks (tune as needed)
    const int MAX_SEND_RETRIES = 5;
    const int BASE_TIMEOUT_MS = 3000;       // per-attempt timeout (increase from 1s)
    const int RESTART_AFTER_FAIL = 3;       // restart ws_client_audio after these many failures

    for (;;) {
        /* Wait for a frame to appear in the outgoing queue */
        if (xQueueReceive(wifi_send_q, &frame, portMAX_DELAY) != pdTRUE) {
            continue;
        }
        if (!frame || !frame->data || frame->len == 0) {
            free_wifi_frame(frame);
            frame = NULL;
            continue;
        }

        /* If audio WS isn't connected, try a few requeues; else drop */
        if (!ws_client_audio || !esp_websocket_client_is_connected(ws_client_audio)) {
            ESP_LOGW("WiFiSendTask", "Audio WS not ready, attempting requeue");
            if (xQueueSend(wifi_send_q, &frame, pdMS_TO_TICKS(200)) != pdTRUE) {
                ESP_LOGW("WiFiSendTask", "Requeue failed — dropping frame");
                free_wifi_frame(frame);
            } else {
                ESP_LOGI("WiFiSendTask", "Frame requeued");
            }
            frame = NULL;
            vTaskDelay(pdMS_TO_TICKS(10));
            continue;
        }

        /* We'll attempt to send the frame in smaller websocket sends */
        size_t total = frame->len;
        size_t offset = 0;
        int consecutive_failures = 0;
        int send_attempts = 0;

        while (offset < total) {
            size_t remaining = total - offset;
            size_t take = MIN(WS_SEND_CHUNK, remaining);
            esp_err_t rc = ESP_FAIL;
            int attempt = 0;
            int per_attempt_timeout = BASE_TIMEOUT_MS;

            for (attempt = 0; attempt < MAX_SEND_RETRIES; ++attempt) {
                rc = esp_websocket_client_send_bin(ws_client_audio,
                                                  (const char *)(frame->data + offset),
                                                  take,
                                                  per_attempt_timeout);
                if (rc == ESP_OK) break;

                ESP_LOGW("WiFiSendTask", "ws send failed attempt %d rc=%d (%s) offset=%u/%u",
                         attempt + 1, rc, esp_err_to_name(rc), (unsigned)offset, (unsigned)total);

                /* If not connected according to client, break early */
                if (!esp_websocket_client_is_connected(ws_client_audio)) {
                    ESP_LOGW("WiFiSendTask", "ws_client_audio reports disconnected after send failure");
                    break;
                }

                /* Exponential backoff between retries */
                vTaskDelay(pdMS_TO_TICKS(100 * (attempt + 1)));
                per_attempt_timeout = MIN(per_attempt_timeout * 2, 10000); // cap
            }

            if (rc != ESP_OK) {
                consecutive_failures++;
                frames_dropped++;

                ESP_LOGW("WiFiSendTask", "Send permanently failed for chunk at offset %u (consec fails=%d). rc=%d (%s)",
                         (unsigned)offset, consecutive_failures, rc, esp_err_to_name(rc));

                /* If the WS client appears connected but send keeps failing, try restart */
                if (consecutive_failures >= RESTART_AFTER_FAIL) {
                    ESP_LOGW("WiFiSendTask", "Too many consecutive send failures — restarting audio WS client");
                    if (ws_client_audio) {
                        esp_websocket_client_stop(ws_client_audio);
                        esp_websocket_client_destroy(ws_client_audio);
                        ws_client_audio = NULL;
                        atomic_store(&ws_audio_connected, false);
                    }
                    /* give reconnect a chance: requeue the frame once more and break */
                    if (xQueueSend(wifi_send_q, &frame, pdMS_TO_TICKS(200)) != pdTRUE) {
                        ESP_LOGW("WiFiSendTask", "Requeue after restart failed — dropping frame");
                        free_wifi_frame(frame);
                    } else {
                        ESP_LOGI("WiFiSendTask", "Frame requeued after ws restart");
                    }
                    frame = NULL;
                    vTaskDelay(pdMS_TO_TICKS(200)); // breathing room
                    break;
                } else {
                    /* drop this chunk and continue to next chunk (best-effort) */
                    offset += take;
                    /* minor delay to avoid tight loop */
                    vTaskDelay(pdMS_TO_TICKS(5));
                    continue;
                }
            } else {
                /* success: advance */
                offset += take;
                consecutive_failures = 0;
                send_attempts++;
                vTaskDelay(pdMS_TO_TICKS(1)); // yield to Wi-Fi stack
            }
        } /* end per-frame send loop */

        /* if frame still valid and not recycled by requeue logic, free it */
        if (frame) {
            free_wifi_frame(frame);
            frame = NULL;
        }
    } /* outer for */
}

/* ---------- I2S capture task (BLOCKING) ---------- */
void i2s_capture_task(void *pvParameters)
{
    ESP_LOGI("I2S_CAP", "i2s_capture_task start (blocking-read)");
    esp_task_wdt_add(NULL);

    /* use a moderate blocking read size; must be <= the DMA buffer you allocated */
    const size_t bytes_per_read = I2S_BUF_SIZE;
    const size_t target_us = 120000;  // 120 ms cadence target in microseconds

    static uint8_t batch_buf[MAX_BATCH_PCM_BYTES];
    size_t batch_offset = 0;
    size_t batch_frames = 0;
    uint64_t last_ts = esp_timer_get_time();

    frames_dropped = 0;

