SpeechsterInnovations/Speechster_ESP32-H2-Testing/Speechster-ESP32-S3-PR1/Main-Working/main/main.c
    for (;;) {
        /* Wait until mic_active (notify-based) */
        while (!atomic_load(&mic_active)) {
            /* block with timeout so WDT can be serviced */
            ulTaskNotifyTake(pdTRUE, pdMS_TO_TICKS(500));
            if (!atomic_load(&mic_active)) {
                esp_task_wdt_reset();
                continue;
            }
            break;
        }

        /* Ensure rx_chan exists; try to init once if missing */
        if (!rx_chan && atomic_load(&mic_active)) {
            ESP_LOGI("I2S_CAP", "rx_chan NULL — initializing");
            i2s_init_inmp441();
            if (!rx_chan) {
                ESP_LOGE("I2S_CAP", "i2s init failed; retrying in 200 ms");
                vTaskDelay(pdMS_TO_TICKS(200));
                continue;
            }
        }

        batch_offset = 0;
        batch_frames = 0;
        last_ts = esp_timer_get_time();

        /* Main capture loop — blocking read until mic deactivated */
        while (atomic_load(&mic_active)) {
            esp_task_wdt_reset();

            size_t bytes_read = 0;

            if (!rx_chan) {
                ESP_LOGE("I2S_CAP", "rx_chan unexpectedly NULL inside capture");
                break;
            }

            /* BLOCKING read: wait until DMA provides data */
            esp_err_t ret = i2s_channel_read(rx_chan,
                                            (void *)i2s_dma_buf,
                                            bytes_per_read,
                                            &bytes_read,
                                            portMAX_DELAY);  // block indefinitely (until data)
            if (ret == ESP_OK && bytes_read == 0) {
                /* weird but harmless — small yield */
                vTaskDelay(pdMS_TO_TICKS(2));
                continue;
            }

            if (ret != ESP_OK) {
                ESP_LOGW("I2S_CAP", "i2s_channel_read returned %s — attempting graceful recovery", esp_err_to_name(ret));
                /* try one quick cycle to reset DMA state, then break to outer loop for reinit */
                if (rx_chan) {
                    i2s_channel_disable(rx_chan);
                    i2s_del_channel(rx_chan);
                    rx_chan = NULL;
                }
                break;
            }

            /* Convert 32-bit samples -> 16-bit and append to batch buffer */
            int32_t *src = (int32_t *)i2s_dma_buf;
            size_t samples = bytes_read / sizeof(int32_t);
            size_t max_samples = (MAX_BATCH_PCM_BYTES - batch_offset) / sizeof(int16_t);
            if (samples > max_samples) samples = max_samples;

            int16_t *dst = (int16_t *)(batch_buf + batch_offset);
            for (size_t i = 0; i < samples; ++i) {
                /* shift down from 32-bit slot; >>8 preserves top 24 bits */
                dst[i] = (int16_t)(src[i] >> 8);
            }

            batch_offset += samples * sizeof(int16_t);
            batch_frames++;

            /* When enough frames collected, package and enqueue */
            if (batch_frames >= FRAMES_PER_BATCH) {
                uint32_t ts = (uint32_t)(esp_timer_get_time() / 1000ULL);
                uint16_t seq = (uint16_t)__atomic_fetch_add(&seq_counter, 1, __ATOMIC_SEQ_CST);
                size_t frame_len = 8 + batch_offset;

                pack_header(audio_frame_buf, 0x01, AUDIO_FLAG_PCM, seq, ts);
                memcpy(audio_frame_buf + 8, batch_buf, batch_offset);

                wifi_frame_t *wframe = alloc_wifi_frame(frame_len);
                if (wframe) {
                    memcpy(wframe->data, audio_frame_buf, frame_len);
                    wframe->len = frame_len;
                    if (xQueueSend(wifi_send_q, &wframe, pdMS_TO_TICKS(50)) != pdTRUE) {
                        free_wifi_frame(wframe);
                        frames_dropped++;
                    } else {
                        frames_sent++;
                    }
                } else {
                    ESP_LOGE("WiFiQueue", "alloc_wifi_frame failed — dropping batch");
                    frames_dropped++;
                }

                batch_offset = 0;
                batch_frames = 0;

                /* keep rough cadence but let blocking reads determine pacing */
                uint64_t now_ts = esp_timer_get_time();
                int64_t remain_us = (int64_t)target_us - (int64_t)(now_ts - last_ts);
                if (remain_us > 0) {
                    vTaskDelay(pdMS_TO_TICKS((remain_us + 999) / 1000));
                }
                last_ts = esp_timer_get_time();
            }
        } /* inner while (mic_active) */

        /* Graceful disable on mic stop */
        ESP_LOGI("I2S_CAP", "Mic deactivated — disabling RX channel (if present)");
        if (rx_chan) {
            esp_err_t dis = i2s_channel_disable(rx_chan);
            if (dis != ESP_OK && dis != ESP_ERR_INVALID_STATE) {
                ESP_LOGW("I2S_CAP", "i2s_channel_disable rc=%s", esp_err_to_name(dis));
            }
        }

        if (atomic_load(&i2s_deinit_requested)) {
            atomic_store(&i2s_deinit_requested, false);
            i2s_del_channel_from_capture();
        }

        esp_task_wdt_reset();
    } /* outer for */
}

static TaskHandle_t wifi_watchdog_handle = NULL;

void wifi_watchdog_task(void *arg)
{
    ESP_LOGI("WiFiWDT", "wifi_watchdog_task started");
    atomic_store(&wifi_wdt_active, true);

    const uint32_t reconnect_interval_ms = 10000;
    // how long we require stable connection before auto-stopping the watchdog (optional)
    const uint32_t stable_ms_required = 10000;
    uint64_t stable_since = 0;

    while (atomic_load(&wifi_wdt_active)) {
        // If the wifi stack isn't up yet, wait a bit and keep looping
        if (!wifi_stack_started) {
            vTaskDelay(pdMS_TO_TICKS(2000));
            continue;
        }

        bool is_connected = atomic_load(&wifi_connected);

        if (!is_connected) {
            ESP_LOGW("WiFiWDT", "Not connected — requesting esp_wifi_connect()");
            esp_err_t rc = esp_wifi_connect();
            if (rc != ESP_OK) {
                ESP_LOGW("WiFiWDT", "esp_wifi_connect returned %s", esp_err_to_name(rc));
            }
            stable_since = 0; // reset stable timer
        } else {
            // connection present: start/continue stable timer
            if (stable_since == 0) stable_since = esp_timer_get_time() / 1000ULL;
            else {
                uint64_t now = esp_timer_get_time() / 1000ULL;
                if (now - stable_since >= stable_ms_required) {
                    ESP_LOGI("WiFiWDT", "Wi-Fi stable for %u ms — stopping watchdog", stable_ms_required);
                    atomic_store(&wifi_wdt_active, false);
                    break;
                }
            }
        }

        vTaskDelay(pdMS_TO_TICKS(reconnect_interval_ms));
    }

    ESP_LOGI("WiFiWDT", "wifi_watchdog_task exiting");
    wifi_watchdog_handle = NULL;
    vTaskDelete(NULL);
}

