SpeechsterInnovations/Speechster_ESP32-H2-Testing/Speechster-ESP32-S3-PR1/Main-Working/main/main.c
static void start_wifi_watchdog_if_needed(void)
{
    if (wifi_watchdog_handle != NULL) return; // already running
    if (xTaskCreate(wifi_watchdog_task, "wifi_watchdog", 4096, NULL, 5, &wifi_watchdog_handle) != pdPASS) {
        ESP_LOGE("WiFiWDT", "Failed to start wifi_watchdog_task");
        wifi_watchdog_handle = NULL;
    } else {
        ESP_LOGI("WiFiWDT", "Watchdog started");
    }
}

static void stop_wifi_watchdog(void)
{
    // polite stop: set flag and wait for task to exit
    atomic_store(&wifi_wdt_active, false);
    if (wifi_watchdog_handle != NULL) {
        // don't call vTaskDelete() blindly from arbitrary context; the task will exit itself.
        // Optionally, wait a short time for it to exit:
        for (int i = 0; i < 10 && wifi_watchdog_handle != NULL; i++) {
            vTaskDelay(pdMS_TO_TICKS(100));
        }
        if (wifi_watchdog_handle != NULL) {
            // as last resort, delete (only if you truly need immediate stop)
            vTaskDelete(wifi_watchdog_handle);
            wifi_watchdog_handle = NULL;
            ESP_LOGW("WiFiWDT", "Watchdog force-deleted");
        } else {
            ESP_LOGI("WiFiWDT", "Watchdog stopped cleanly");
        }
    }
}


/* ---------- FSR ADC (BLE Notify) ---------- */
static void pSensor_task(void *arg)
{
    static adc_digi_output_data_t result[ADC_READ_LEN / sizeof(adc_digi_output_data_t)];
    static uint8_t fsr_frame[8 + 2]; // header + 2B payload
    adc_digi_output_data_t *entry;
    uint8_t payload[2];
    uint32_t evt_size = 0;

    ESP_LOGI("ADC_CONT", "FSR pSensor_task running (event-driven)");

    while (1) {
        if (!adc_running || !pSensor_enabled) {
            vTaskDelay(pdMS_TO_TICKS(200));
            continue;
        }

        if (xQueueReceive(adc_evt_queue, &evt_size, pdMS_TO_TICKS(fsr_interval_ms))) {
            uint32_t bytes_read = 0;
            esp_err_t ret = adc_continuous_read(adc_handle, (uint8_t *)result, sizeof(result), &bytes_read, 0);
            if (ret != ESP_OK || bytes_read < sizeof(adc_digi_output_data_t)) continue;

            size_t entries = bytes_read / sizeof(adc_digi_output_data_t);
            entry = (adc_digi_output_data_t *)result;

            for (size_t i = 0; i < entries; i++) {
                if (entry[i].type2.channel != FSR_ADC_CHANNEL) continue;

                int raw = entry[i].type2.data;
                
                static int last_raw = 0;
                raw = (last_raw * 7 + raw) / 8;  // 0.875 smoothing
                last_raw = raw;

                int mv = 0;
                if (adc_cali_handle) adc_cali_raw_to_voltage(adc_cali_handle, raw, &mv);
                payload[0] = mv & 0xFF;
                payload[1] = (mv >> 8) & 0xFF;

                uint32_t ts = (uint32_t)(esp_timer_get_time() / 1000ULL);
                uint16_t seq = (uint16_t)__atomic_fetch_add(&seq_counter, 1, __ATOMIC_SEQ_CST);

                pack_header(fsr_frame, 0x02, 0x00, seq, ts);
                memcpy(fsr_frame + 8, payload, sizeof(payload));

                size_t frame_len = 8 + sizeof(payload);

                if (atomic_load(&bt_conn) && g_stream_attr_handle != 0) {
                    int rc = send_chunked_notify(g_conn_handle, g_stream_attr_handle, fsr_frame, frame_len);
                    if (rc != 0)
                        ESP_LOGW("ADC_CONT", "BLE notify failed (raw=%d) rc=%d", raw, rc);
                }
            }
        }
    }
}

/* ---- Deferred JSON parsing task ---- */
static void control_task(void *arg)
{
    control_msg_t msg;
    while (1) {
        if (xQueueReceive(ctrl_queue, &msg, portMAX_DELAY) == pdTRUE) {
            LOG_CTRL("rx JSON: %s", msg.json);
            char ack_buf[160];
            snprintf(ack_buf, sizeof(ack_buf),
                     "{\"status\":\"RCVD\",\"msg\":\"%s\"}", msg.json ? msg.json : "");

            ble_send_json_response(ack_buf);


            cJSON *root = cJSON_Parse(msg.json);
            if (root) {
                handle_control_json(root);
                cJSON_Delete(root);
            } else {
                ESP_LOGW(TAG, "[CTRL_ERR] Invalid JSON");
            }

            free(msg.json);
        }
    }
}

/* ---------- GATT: control (write JSON) ---------- */
static int gatt_control_access_cb(uint16_t conn_handle, uint16_t attr_handle,
                                  struct ble_gatt_access_ctxt *ctxt, void *arg)
{
    int len = OS_MBUF_PKTLEN(ctxt->om);
    if (len <= 0) return 0;

    char *json = malloc(len + 1);
    if (!json) return 0;

    os_mbuf_copydata(ctxt->om, 0, len, json);
    json[len] = '\0';

    /* Instead of parsing JSON here, just enqueue it */
    control_msg_t msg = { .len = len, .json = json };
    if (xQueueSend(ctrl_queue, &msg, pdMS_TO_TICKS(10)) != pdTRUE) {
        ESP_LOGW(TAG, "Control queue full; dropping JSON");
        free(json);
    }

    return 0;
}

/* ---------- Pre-allocated notification buffer ---------- */
#define MAX_NOTIFY_BUF  260
static uint8_t notify_buf[MAX_NOTIFY_BUF];

/* ---------- Heap-free BLE sender task (patched footer handling) ---------- */
// returns 0 on success (frame sent), -1 on failure (dropped)
static int send_chunked_notify(uint16_t conn_handle,
                               uint16_t attr_handle,
                               const uint8_t *frame,
                               size_t frame_len)
{
    if (!atomic_load(&bt_conn) || attr_handle == 0)
        return -1;

    esp_task_wdt_reset();

    uint16_t mtu = ble_att_mtu(conn_handle);
    size_t chunk_size = (mtu > 23) ? (mtu - 3) : 20;
    if (mtu > 100)
        chunk_size = mtu - 7;  // use more of the negotiated MTU
    else
        chunk_size = (mtu > 23) ? (mtu - 3) : 20;

    if (frame_len > STREAM_SLICE_MAX)
        frame_len = STREAM_SLICE_MAX;

    size_t offset = 0;
    int consecutive_failures = 0;

    while (offset < frame_len) {
        esp_task_wdt_reset();

        size_t remaining = frame_len - offset;
        size_t take = MIN(chunk_size, remaining);

                // Reuse pre-allocated static notify_buf instead of stack buffer
        // Always copy the 8-byte header into the start of notify_buf on first chunk,
        // then copy payload chunks from frame+8+offset (skip the 8-byte header).
        if (offset == 0) {
            memcpy(notify_buf, frame, 8);
        }

        size_t safe_take = MIN(take, (size_t)(MAX_NOTIFY_BUF - 8));
        /* Source must skip the 8-byte header: payload starts at frame + 8.
           For chunk N we copy from frame + 8 + offset. */
        memcpy(notify_buf + 8, frame + 8 + offset, safe_take);

        // create mbuf only for the amount actually copied (8 + safe_take)
        struct os_mbuf *om = ble_hs_mbuf_from_flat(notify_buf, 8 + safe_take);

        if (!om) {
            vTaskDelay(pdMS_TO_TICKS(3)); // back off slightly
            if (++consecutive_failures >= 5)
                return -1;
            continue;
        }

