SpeechsterInnovations/Speechster_ESP32-H2-Testing/Speechster-ESP32-S3-PR1/Main-Working/main/main.c
        int rc = ble_gatts_notify_custom(conn_handle, attr_handle, om);
        if (rc != 0) {
            os_mbuf_free_chain(om);
            vTaskDelay(pdMS_TO_TICKS(5));
            if (++consecutive_failures >= 5)
                return -1;
            continue;
        }

        /* advance by the number of bytes actually copied */
        offset += safe_take;
        consecutive_failures = 0;

        if (rc == 0) {
            ble_backoff_ms = MAX(2, ble_backoff_ms - 1); // speed up
        } else {
            ble_backoff_ms = MIN(50, ble_backoff_ms + 5); // slow down
        }
        vTaskDelay(pdMS_TO_TICKS(ble_backoff_ms));

    }

    return 0;
}

static void ble_send_json_response(const char *json_str) {
    if (!atomic_load(&bt_conn) || g_stream_attr_handle == 0) {
        ESP_LOGW("BLE_ACK", "No active BLE connection, cannot send ack");
        return;
    }

    size_t len = strlen(json_str);
    if (len > MAX_NOTIFY_BUF - 1) len = MAX_NOTIFY_BUF - 1;

    memcpy(notify_buf, json_str, len);
    notify_buf[len] = '\0';

    struct os_mbuf *om = ble_hs_mbuf_from_flat(notify_buf, len);
    if (!om) {
        ESP_LOGW("BLE_ACK", "Failed to alloc BLE mbuf for ack");
        return;
    }

    int rc = ble_gatts_notify_custom(g_conn_handle, g_stream_attr_handle, om);
    if (rc != 0) {
        ESP_LOGW("BLE_ACK", "Notify failed rc=%d", rc);
    } else {
        ESP_LOGI("BLE_ACK", "Sent BLE ACK: %s", json_str);
    }
}


static int gatt_notify_only_cb(uint16_t conn_handle, uint16_t attr_handle,
                               struct ble_gatt_access_ctxt *ctxt, void *arg)
{
    // No read/write permitted — just return success for compatibility.
    return 0;
}

/* ---------- GATT services ---------- */
static const struct ble_gatt_svc_def gatt_svr_svcs[] = {
    {
        .type = BLE_GATT_SVC_TYPE_PRIMARY,
        .uuid = BLE_UUID16_DECLARE(0xFEED),
        .characteristics = (struct ble_gatt_chr_def[]) {
            {
                .uuid = BLE_UUID128_DECLARE(
                    0xfb,0x34,0x9b,0x5f,0x80,0x00,0x00,0x80,0x00,0x00,0x10,0x00,0x01,0x00,0xed,0xfe
                ),
                .access_cb = gatt_control_access_cb,
                .flags = BLE_GATT_CHR_F_WRITE | BLE_GATT_CHR_F_WRITE_NO_RSP,
            },
            {
                .uuid = BLE_UUID128_DECLARE(
                    0xfb,0x34,0x9b,0x5f,0x80,0x00,0x00,0x80,0x00,0x00,0x10,0x00,0x02,0x00,0xed,0xfe
                ),
                .access_cb = gatt_notify_only_cb,
                .flags = BLE_GATT_CHR_F_NOTIFY,
            },
            { 0 }
        },
    },
    { 0 }
};


/* ---------- BLE GAP events ---------- */
static int ble_gap_event(struct ble_gap_event *event, void *arg) {
    switch (event->type) {

        case BLE_GAP_EVENT_CONNECT:
            if (event->connect.status == 0) {
                g_conn_handle = event->connect.conn_handle;
                ESP_LOGI(TAG, "Connected (handle %d)", g_conn_handle);
                
                // Request slightly longer connection interval to reduce radio duty-cycle (saves power/heat)
                struct ble_gap_upd_params params = {
                    .itvl_min = 24,   // 24 * 1.25 ms = 30 ms
                    .itvl_max = 30,   // 30 * 1.25 ms = 37.5 ms
                    .latency  = 4,    // allow some event skipping
                    .supervision_timeout = 400, // 4 s
                };
                int upd_rc = ble_gap_update_params(g_conn_handle, &params);
                ESP_LOGI(TAG, "ble_gap_update_params rc=%d (30-37ms, latency=4)", upd_rc);

                int phy_rc = ble_gap_set_prefered_le_phy(g_conn_handle, BLE_HCI_LE_PHY_1M, BLE_HCI_LE_PHY_1M, 0);

                ESP_LOGI(TAG, "ble_gap_set_prefered_le_phy rc=%d", phy_rc);
                atomic_store(&bt_conn, true);

            } else {
                ESP_LOGW(TAG, "Connect failed; status=%d", event->connect.status);
                // Restart advertising
                ble_gap_adv_start(BLE_OWN_ADDR_PUBLIC, NULL, BLE_HS_FOREVER, NULL, ble_gap_event, NULL);
            }
            break;

            case BLE_GAP_EVENT_DISCONNECT:
                ESP_LOGW(TAG, "Client disconnected (reason=%d)", event->disconnect.reason);

                ESP_LOGI("BLE", "Client disconnected, stopping Wi-Fi watchdog...");
                if (wifi_watchdog_handle != NULL) {
                    stop_wifi_watchdog();
                    wifi_watchdog_handle = NULL;
                }


                // Atomic BLE state reset
                atomic_store(&mic_active, false);
                atomic_store(&bt_conn, false);
                atomic_store(&streaming, false);
                g_stream_attr_handle = 0;

                ESP_LOGI(TAG, "Flushed pending ringbuffer items and reset backoff");

                vTaskDelay(pdMS_TO_TICKS(200));
                ESP_LOGI(TAG, "Restarting advertising after disconnect...");
                ble_gap_adv_start(BLE_OWN_ADDR_PUBLIC, NULL, BLE_HS_FOREVER, NULL, ble_gap_event, NULL);
                break;

        case BLE_GAP_EVENT_SUBSCRIBE:
            ESP_LOGI(TAG, "Subscribe: conn=%d attr_handle=%d cur_notify=%d",
                    event->subscribe.conn_handle,
                    event->subscribe.attr_handle,
                    event->subscribe.cur_notify);

            if (event->subscribe.cur_notify) {
                g_stream_attr_handle = event->subscribe.attr_handle;
                ESP_LOGI(TAG, "Cached stream attr handle: %d", g_stream_attr_handle);
            } else if (g_stream_attr_handle == event->subscribe.attr_handle) {
                g_stream_attr_handle = 0;
            }
            break;

        case BLE_GAP_EVENT_MTU:
            ESP_LOGI(TAG, "MTU exchange event: conn=%d mtu=%u",
                     event->mtu.conn_handle, event->mtu.value);
            uint16_t cur_mtu = ble_att_mtu(g_conn_handle);
            ESP_LOGI(TAG, "ble_att_mtu() => %u", cur_mtu);
            break;

        default:
            break;
    }

