SpeechsterInnovations/Speechster_ESP32-H2-Testing/Speechster-ESP32-S3-PR1/Main-Working/main/main.c
    return 0;
}

/* ---------- Advertising (uses proper uuid type) ---------- */
static void start_advertise(void) {
    struct ble_hs_adv_fields fields;
    memset(&fields, 0, sizeof(fields));

    const char *name = "Speechster-B1";
    fields.flags = BLE_HS_ADV_F_DISC_GEN | BLE_HS_ADV_F_BREDR_UNSUP;
    fields.name = (uint8_t*) name;
    fields.name_len = strlen(name);
    fields.name_is_complete = 1;

    /* Use ble_uuid16_t array for fields.uuids16 */
    static const ble_uuid16_t adv_uuids[] = { BLE_UUID16_INIT(0xFEED) };
    fields.uuids16 = adv_uuids;
    fields.num_uuids16 = 1;
    fields.uuids16_is_complete = 1;

    int rc = ble_gap_adv_set_fields(&fields);
    if (rc != 0) {
        ESP_LOGE(TAG, "ble_gap_adv_set_fields rc=%d", rc);
        return;
    }

    struct ble_gap_adv_params advp;
    memset(&advp, 0, sizeof(advp));
    advp.conn_mode = BLE_GAP_CONN_MODE_UND;
    advp.disc_mode = BLE_GAP_DISC_MODE_GEN;
    rc = ble_gap_adv_start(BLE_OWN_ADDR_PUBLIC, NULL, BLE_HS_FOREVER, &advp, ble_gap_event, NULL);
    if (rc != 0) {
        ESP_LOGE(TAG, "ble_gap_adv_start rc=%d", rc);
    } else {
        ESP_LOGI(TAG, "Advertising started (name=%s)", name);
    }
}

/* NimBLE sync callback */
static void ble_on_sync(void) {
    ble_svc_gap_device_name_set("Speechster-B1");


    // Request preferred ATT MTU
    int rc = ble_att_set_preferred_mtu(517);
    ESP_LOGI(TAG, "ble_att_set_preferred_mtu rc=%d", rc);


    rc = ble_gatts_count_cfg(gatt_svr_svcs);
    if (rc != 0) {
        ESP_LOGE(TAG, "ble_gatts_count_cfg rc=%d", rc);
        return;
    }

    rc = ble_gatts_add_svcs(gatt_svr_svcs);
    if (rc != 0) {
        ESP_LOGE(TAG, "ble_gatts_add_svcs rc=%d", rc);
        return;
    }

    rc = ble_gatts_start();
    if (rc != 0) {
        ESP_LOGE(TAG, "ble_gatts_start rc=%d", rc);
        return;
    }

    start_advertise();
}


/* NimBLE host task */
static void nimble_host_task(void *param) {
    nimble_port_run();
    nimble_port_freertos_deinit();
}

/* Initialize NimBLE */
static void init_nimble(void) {

    // Initialize nimble host stack
    nimble_port_init();

    // Host callbacks
    ble_hs_cfg.sync_cb = ble_on_sync;
    ble_hs_cfg.gatts_register_cb = NULL;
    ble_hs_cfg.store_status_cb = NULL;

    // Start the NimBLE host task
    nimble_port_freertos_init(nimble_host_task);
}

// ─────────────────────────────────────────────
// Wi-Fi + Server setup
// ─────────────────────────────────────────────

static httpd_handle_t stream_server = NULL;

static esp_err_t audio_stream_post(httpd_req_t *req) {
    char buf[512];
    int ret, remaining = req->content_len;
    while (remaining > 0) {
        if ((ret = httpd_req_recv(req, buf, MIN(remaining, sizeof(buf)))) <= 0) break;
        remaining -= ret;
        // Here you can feed the incoming audio to your decoder/processor
    }
    httpd_resp_sendstr(req, "OK");
    return ESP_OK;
}

static const httpd_uri_t audio_post = {
    .uri = "/audio",
    .method = HTTP_POST,
    .handler = audio_stream_post,
};

static void start_http_server(void) {
    httpd_config_t config = HTTPD_DEFAULT_CONFIG();
    config.server_port = 8080;
    if (httpd_start(&stream_server, &config) == ESP_OK) {
        httpd_register_uri_handler(stream_server, &audio_post);
        ESP_LOGI("HTTP", "Audio endpoint started on port %d", config.server_port);
    }
}

// ─────────────────────────────────────────────
// Wi-Fi Credential Persistence (NVS)
// ─────────────────────────────────────────────
static void save_wifi_creds(const char *ssid, const char *pass, const char *ip, const char *port) {
    nvs_handle_t nvs;
    if (nvs_open("wifi", NVS_READWRITE, &nvs) == ESP_OK) {
        nvs_set_str(nvs, "ssid", ssid);
        nvs_set_str(nvs, "pass", pass);
        nvs_set_str(nvs, "ip", ip);
        nvs_set_str(nvs, "port", port);
        nvs_commit(nvs);
        nvs_close(nvs);
        ESP_LOGI("WiFiNVS", "Saved Wi-Fi creds: SSID=%s SERVER=%s:%s", ssid, ip, port);
    } else {
        ESP_LOGE("WiFiNVS", "Failed to open NVS for Wi-Fi save");
    }
}


static bool load_wifi_creds(char *ssid, size_t ssid_len,
                            char *pass, size_t pass_len,
                            char *ip, size_t ip_len,
                            char *port, size_t port_len) {
    nvs_handle_t nvs;
    esp_err_t err = nvs_open("wifi", NVS_READONLY, &nvs);
    if (err != ESP_OK) return false;

    bool ok = true;
    if (nvs_get_str(nvs, "ssid", ssid, &ssid_len) != ESP_OK) ok = false;
    if (nvs_get_str(nvs, "pass", pass, &pass_len) != ESP_OK) ok = false;
    if (nvs_get_str(nvs, "ip", ip, &ip_len) != ESP_OK) ok = false;
    if (nvs_get_str(nvs, "port", port, &port_len) != ESP_OK) ok = false;

    nvs_close(nvs);
    return ok;
}

static void websocket_event_handler(void *handler_args, esp_event_base_t base, int32_t event_id, void *event_data)
{
    esp_websocket_event_data_t *data = (esp_websocket_event_data_t *)event_data;
    esp_websocket_client_handle_t client = (esp_websocket_client_handle_t) handler_args;

    switch (event_id) {
        case WEBSOCKET_EVENT_CONNECTED:
            if (client == ws_client_ctrl) {
                atomic_store(&wifi_connected, true);
                ESP_LOGI("WS", "Control WS connected (%p)", client);
            } else if (client == ws_client_audio) {
                atomic_store(&ws_audio_connected, true);
                ESP_LOGI("WS", "Audio WS connected (%p)", client);
            } else {
                ESP_LOGI("WS", "Unknown WS connected (%p)", client);
            }
            break;

        case WEBSOCKET_EVENT_DISCONNECTED:
            if (client == ws_client_ctrl) {
                atomic_store(&wifi_connected, false);
                atomic_store(&ws_ctrl_connected, false);
                ESP_LOGW("WS", "Control WS disconnected");
                ws_action_t a = WS_ACTION_DESTROY_CTRL;
                xQueueSend(ws_mgr_q, &a, 0);

                        } else if (client == ws_client_audio) {
                atomic_store(&ws_audio_connected, false);
                ESP_LOGW("WS", "Audio WS disconnected");

                // Defer destroy to manager task (safe context)
                if (ws_mgr_q) {
                    ws_action_t a = WS_ACTION_DESTROY_AUDIO;
                    if (xQueueSend(ws_mgr_q, &a, 0) != pdTRUE) {
                        ESP_LOGW("WS", "ws_mgr_q full, will attempt destroy later");
                    }
                } else {
                    // Fallback: if manager not available, mark and try to stop later
                    ESP_LOGW("WS", "ws_mgr_q not ready — audio client left for cleanup");
                }
            } else {
                ESP_LOGW("WS", "Unknown WS disconnected");
            }
            break;

        case WEBSOCKET_EVENT_DATA:
            if (client == ws_client_ctrl) {
                const char *buf = data->data_ptr;
                size_t len = data->data_len;

                // Sanity: ignore empty or non-printable frames
                if (!buf || len < 2) break;
                bool printable = true;
                for (size_t i = 0; i < len; i++) {
                    if (buf[i] < 0x09 || buf[i] > 0x7E) { // outside normal text range
                        printable = false;
                        break;
                    }
                }
                if (!printable) {
                    ESP_LOGD("WS", "[CTRL] Ignored non-text frame (len=%d)", (int)len);
                    break;
                }

                // Skip whitespace
                while (len && isspace((unsigned char)*buf)) {
                    buf++; len--;
                }

                // Must start and end like JSON
                if (len < 2 || !((*buf == '{' && buf[len - 1] == '}') ||
                    (*buf == '[' && buf[len - 1] == ']'))) {
                    ESP_LOGD("WS", "[CTRL] Ignored frame (no JSON delimiters, len=%d)", (int)data->data_len);
                    break;
                    }

