SpeechsterInnovations/Speechster_ESP32-H2-Testing/Speechster-ESP32-S3-PR1/Main-Working/main/main.c
                    // Parse safely
                    cJSON *root = cJSON_ParseWithLength(buf, len);
                    if (!root) {
                        ESP_LOGD("WS", "[CTRL] Invalid JSON ignored (len=%d)", (int)len);
                        break;
                    }

                    cJSON *cmd = cJSON_GetObjectItem(root, "command");
                    if (cmd && cJSON_IsObject(cmd)) {
                        char *json_str = cJSON_PrintUnformatted(cmd);
                        if (json_str) {
                            control_msg_t msg = { .len = strlen(json_str), .json = json_str };
                            if (!ctrl_queue || xQueueSend(ctrl_queue, &msg, pdMS_TO_TICKS(10)) != pdTRUE)
                                free(json_str);
                        }
                    }
                    cJSON_Delete(root);
            }
            break;


        default:
            break;
    }
}

// ─────────────────────────────────────────────
// Wi-Fi event handlers
// ─────────────────────────────────────────────
static void wifi_event_handler(void *arg, esp_event_base_t event_base,
                               int32_t event_id, void *event_data) {
    if (event_base == WIFI_EVENT && event_id == WIFI_EVENT_STA_START) {
        // explicit connect on start is okay; event-driven connect is safe
        esp_wifi_connect();
    } else if (event_base == WIFI_EVENT && event_id == WIFI_EVENT_STA_DISCONNECTED) {
        wifi_event_sta_disconnected_t *disc = (wifi_event_sta_disconnected_t *)event_data;
        atomic_store(&wifi_connected, false);
        ESP_LOGW(WIFI_TAG, "Disconnected (reason=%d), retrying...", disc ? disc->reason : -1);
        
        if (disc) {
            switch (disc->reason) {
                case WIFI_REASON_AUTH_EXPIRE:
                case WIFI_REASON_AUTH_FAIL:
                case WIFI_REASON_4WAY_HANDSHAKE_TIMEOUT:
                    ESP_LOGE(WIFI_TAG, "❌ Authentication failed — wrong password or mismatched security mode.");
                    break;

                case WIFI_REASON_NO_AP_FOUND:
                    ESP_LOGE(WIFI_TAG, "🚫 No AP found for SSID '%s' — check name and 2.4GHz availability.", disc ? (char*)disc->ssid : "(unknown)");
                    break;

                case WIFI_REASON_ASSOC_FAIL:
                case WIFI_REASON_ASSOC_LEAVE:
                    ESP_LOGE(WIFI_TAG, "⚠️ Association failed — signal too weak or AP refused connection.");
                    break;

                case WIFI_REASON_BEACON_TIMEOUT:
                    ESP_LOGE(WIFI_TAG, "📡 Beacon timeout — lost AP signal (weak link or interference).");
                    break;

                case WIFI_REASON_HANDSHAKE_TIMEOUT:
                    ESP_LOGE(WIFI_TAG, "⚠️ WPA handshake timeout — router didn't respond in time.");
                    break;

                case WIFI_REASON_MIC_FAILURE:
                    ESP_LOGE(WIFI_TAG, "🔒 WPA MIC failure — corrupted frame or bad encryption key.");
                    break;

                case WIFI_REASON_AUTH_LEAVE:
                    ESP_LOGE(WIFI_TAG, "🔄 Deauthenticated by AP — router booted you.");
                    break;

                default:
                    ESP_LOGW(WIFI_TAG, "🤔 Unknown Wi-Fi disconnect reason: %d", disc->reason);
                    break;
            }
        } else {
            ESP_LOGW(WIFI_TAG, "Wi-Fi disconnect: event_data was null");
        }

        if (wifi_http_client) {
            esp_http_client_cleanup(wifi_http_client);
            wifi_http_client = NULL;
        }
        // Let the watchdog manage backoff/reconnect attempts; still call connect once
        esp_wifi_connect();
    } else if (event_base == IP_EVENT && event_id == IP_EVENT_STA_GOT_IP) {

        ESP_LOGI(WIFI_TAG, "Flushing stale WS handles before reconnect...");
        if (ws_client_ctrl) {
            esp_websocket_client_stop(ws_client_ctrl);
            esp_websocket_client_destroy(ws_client_ctrl);
            ws_client_ctrl = NULL;
        }
        if (ws_client_audio) {
            esp_websocket_client_stop(ws_client_audio);
            esp_websocket_client_destroy(ws_client_audio);
            ws_client_audio = NULL;
        }

        ESP_LOGI(WIFI_TAG, "Connected to Wi-Fi");

        // Do NOT use SSL transport here unless URI starts with wss://
        // The esp-tls layer will hang like a drunken cat on a ceiling fan.

        // Create / start control WS client
        esp_websocket_client_config_t ctrl_cfg = {
            .uri = WS_CTRL_URI,
            .transport = WEBSOCKET_TRANSPORT_OVER_TCP,
            .reconnect_timeout_ms = 3000,
            .keep_alive_idle = 10,
            .keep_alive_interval = 10,
            .keep_alive_count = 3,
            .network_timeout_ms = 10000
        };

        if (ws_client_ctrl) {
            esp_websocket_client_stop(ws_client_ctrl);
            esp_websocket_client_destroy(ws_client_ctrl);
            ws_client_ctrl = NULL;
        }

        ws_client_ctrl = esp_websocket_client_init(&ctrl_cfg);
        if (ws_client_ctrl) {
            esp_websocket_register_events(ws_client_ctrl, WEBSOCKET_EVENT_ANY,
                                          websocket_event_handler, (void *)ws_client_ctrl);
            esp_websocket_client_start(ws_client_ctrl);
            ESP_LOGI(WIFI_TAG, "Control WS client started (%s)", WS_CTRL_URI);
            atomic_store(&ws_ctrl_connected, true);
        } else {
            ESP_LOGW(WIFI_TAG, "Failed to init control WS client");
            atomic_store(&ws_ctrl_connected, false);
        }

        // Create / start audio WS client
        esp_websocket_client_config_t audio_cfg = {
            .uri = WS_AUDIO_URI,
            .transport = WEBSOCKET_TRANSPORT_OVER_TCP,
            .network_timeout_ms = 10000,
            .reconnect_timeout_ms = 3000,
            .keep_alive_idle = 10,
            .keep_alive_interval = 10,
            .keep_alive_count = 3
        };

        if (ws_client_audio) {
            esp_websocket_client_stop(ws_client_audio);
            esp_websocket_client_destroy(ws_client_audio);
            ws_client_audio = NULL;
        }

        ws_client_audio = esp_websocket_client_init(&audio_cfg);
        if (ws_client_audio) {
            esp_websocket_register_events(ws_client_audio, WEBSOCKET_EVENT_ANY,
                                          websocket_event_handler, (void *)ws_client_audio);
            esp_websocket_client_start(ws_client_audio);
            ESP_LOGI(WIFI_TAG, "Audio WS client started (%s)", WS_AUDIO_URI);
            atomic_store(&ws_audio_connected, true);
        } else {
            ESP_LOGW(WIFI_TAG, "Failed to init audio WS client");
            atomic_store(&ws_audio_connected, false);
        }

