SpeechsterInnovations/Speechster_ESP32-H2-Testing/Speechster-ESP32-S3-PR1/Main-Working/main/main.c
        ESP_LOGI(WIFI_TAG, "Starting HTTP server");
        if (!stream_server) {
            start_http_server();
        }
    }
}

static void wifi_init_sta(const char *ssid, const char *pass) {
    ESP_LOGI("WiFi", "Initializing Wi-Fi stack...");

    esp_err_t err;

    // Always init core subsystems — these are idempotent
    ESP_ERROR_CHECK(esp_netif_init());
    err = esp_event_loop_create_default();
    if (err != ESP_OK && err != ESP_ERR_INVALID_STATE) {
        ESP_LOGE("WiFi", "esp_event_loop_create_default failed: %s", esp_err_to_name(err));
    }

    // ensure STA netif exists but do not assert if already present
    esp_netif_t *sta_netif = ensure_sta_netif();
    if (!sta_netif) {
        ESP_LOGW("WiFi", "Failed to ensure STA netif; continuing but esp_wifi may fail");
    }

    wifi_init_config_t cfg = WIFI_INIT_CONFIG_DEFAULT();
    ESP_ERROR_CHECK(esp_wifi_init(&cfg));

    err = esp_event_handler_register(WIFI_EVENT, ESP_EVENT_ANY_ID, wifi_event_handler, NULL);
    err = esp_event_handler_register(IP_EVENT, IP_EVENT_STA_GOT_IP, wifi_event_handler, NULL);

    wifi_config_t wifi_config = {0};
    strncpy((char *)wifi_config.sta.ssid, ssid, sizeof(wifi_config.sta.ssid) - 1);
    strncpy((char *)wifi_config.sta.password, pass, sizeof(wifi_config.sta.password) - 1);
    wifi_config.sta.threshold.authmode = WIFI_AUTH_WPA2_PSK;  // default safe auth mode

    ESP_ERROR_CHECK(esp_wifi_set_mode(WIFI_MODE_STA));
    ESP_ERROR_CHECK(esp_wifi_set_config(WIFI_IF_STA, &wifi_config));

    esp_err_t start_rc = esp_wifi_start();
    if (start_rc == ESP_OK) {
        wifi_stack_started = true;
        ESP_LOGI("WiFi", "esp_wifi_start OK — awaiting WIFI_EVENT_STA_START to connect");
        // Do NOT call esp_wifi_connect() here to avoid races with driver initialization.
        // The wifi_event_handler will perform the actual connect on WIFI_EVENT_STA_START.
    } else {
        wifi_stack_started = false;
        ESP_LOGE("WiFi", "esp_wifi_start failed: %s", esp_err_to_name(start_rc));
        return;
    }

    // Cap TX power to prevent overheat / excessive current draw
    esp_err_t rc = esp_wifi_set_max_tx_power(32);  // ~10 dBm
    if (rc != ESP_OK)
        ESP_LOGW("WiFi", "esp_wifi_set_max_tx_power rc=%s", esp_err_to_name(rc));

    // Spawn watchdog after Wi-Fi confirmed up
    //xTaskCreate(wifi_watchdog_task, "wifi_wdt_task", 8192, NULL, 2, NULL);
}

// ─────────────────────────────────────────────
// BLE callback to receive Wi-Fi credentials
// ─────────────────────────────────────────────
void ble_on_wifi_creds_received(const char *json_str) {
    cJSON *root = cJSON_Parse(json_str);
    if (!root) {
        ESP_LOGW("BLE_CFG", "Invalid JSON in BLE payload");
        return;
    }

    const cJSON *j_ssid = cJSON_GetObjectItem(root, "ssid");
    const cJSON *j_pass = cJSON_GetObjectItem(root, "pass");
    const cJSON *j_ip   = cJSON_GetObjectItem(root, "host_ip");
    const cJSON *j_port = cJSON_GetObjectItem(root, "host_port");

    if (!cJSON_IsString(j_ssid) || !cJSON_IsString(j_pass) || !cJSON_IsString(j_ip) || !cJSON_IsString(j_port)) {
        ESP_LOGE("BLE_CFG", "Invalid BLE JSON received");
        cJSON_Delete(root);
        ble_send_json_response("{\"status\":\"ERR\",\"msg\":\"Invalid JSON\"}");
        return;
    }

    wifi_creds_t creds;
    memset(&creds, 0, sizeof(creds));
    strncpy(creds.ssid, j_ssid->valuestring, sizeof(creds.ssid)-1);
    strncpy(creds.pass, j_pass->valuestring, sizeof(creds.pass)-1);
    strncpy(creds.ip,   j_ip->valuestring,   sizeof(creds.ip)-1);
    strncpy(creds.port, j_port->valuestring, sizeof(creds.port)-1);

    // Save to NVS immediately (safe from BLE context)
    save_wifi_creds(creds.ssid, creds.pass, creds.ip, creds.port);

    ESP_LOGI("BLE_CFG", "Parsed Wi-Fi creds: ssid=%s pass=%s", creds.ssid, creds.pass);
    nvs_handle_t nvs;
    if (nvs_open("wifi", NVS_READWRITE, &nvs) == ESP_OK) {
        nvs_erase_all(nvs);
        nvs_close(nvs);
    }

    // 🔧 Immediately update runtime URIs
    snprintf(WS_CTRL_URI, sizeof(WS_CTRL_URI), "ws://%s:%s/ws", creds.ip, creds.port);
    snprintf(WS_AUDIO_URI, sizeof(WS_AUDIO_URI), "ws://%s:%s/data/audio", creds.ip, creds.port);
    snprintf(OTA_URL, sizeof(OTA_URL), "http://%s:%s/ota/latest.bin", creds.ip, creds.port);
    snprintf(TELEMETRY_URL, sizeof(TELEMETRY_URL), "http://%s:%s/esp/telemetry", creds.ip, creds.port);

    ESP_LOGI("BLE_CFG", "Updated runtime URIs:");
    ESP_LOGI("BLE_CFG", "  CTRL=%s", WS_CTRL_URI);
    ESP_LOGI("BLE_CFG", "  AUDIO=%s", WS_AUDIO_URI);

    // ACK right away
    ble_send_json_response("{\"status\":\"OK\",\"msg\":\"WiFi credentials saved\"}");


    // If Wi-Fi stack already started, update config in short task to avoid double-init.
    wifi_creds_t *heap_creds = malloc(sizeof(wifi_creds_t));
    if (!heap_creds) {
        ESP_LOGE("BLE_CFG", "malloc failed for wifi creds");
        cJSON_Delete(root);
        return;
    }
    memcpy(heap_creds, &creds, sizeof(wifi_creds_t));

    if (wifi_stack_started) {

        if (ws_client_ctrl) {
            esp_websocket_client_stop(ws_client_ctrl);
            esp_websocket_client_destroy(ws_client_ctrl);
            ws_client_ctrl = NULL;
        }
        if (ws_client_audio) {
            esp_websocket_client_stop(ws_client_audio);
            esp_websocket_client_destroy(ws_client_audio);
            ws_client_audio = NULL;
        }

        start_wifi_watchdog_if_needed();

        // Wi-Fi driver already initialized — reconfigure instead of reinitializing
        BaseType_t rc = xTaskCreate(wifi_reconfigure_task, "wifi_recfg", 4096, heap_creds, 5, NULL);
        if (rc != pdPASS) {
            ESP_LOGE("BLE_CFG", "Failed to create wifi_reconfigure_task");
            free(heap_creds);
        } else {
            ESP_LOGI("BLE_CFG", "wifi_reconfigure_task created (reconfigure path)");
        }
    } else {
        // Wi-Fi stack not started — do full init in wifi_init_task
        BaseType_t rc = xTaskCreate(wifi_init_task, "wifi_init_task", 12288, heap_creds, 3, NULL);
        ESP_LOGI("BLE_CFG", "wifi_init_task create result: %d", rc);
        if (rc != pdPASS) {
            ESP_LOGE("BLE_CFG", "Failed to create wifi_init_task");
            free(heap_creds);
        } else {
            ESP_LOGI("BLE_CFG", "wifi_init_task created successfully");
        }
    }


