SpeechsterInnovations/Speechster_ESP32-H2-Testing/Speechster-ESP32-S3-PR1/Main-Working/main/main.c
    cJSON_Delete(root);
}

void loadNVSData(void) {
    char ssid[32], pass[64], ip[32], port[16];
    if (load_wifi_creds(ssid, sizeof(ssid), pass, sizeof(pass), ip, sizeof(ip), port, sizeof(port))) {
        
        snprintf(WS_CTRL_URI, sizeof(WS_CTRL_URI), "ws://%s:%s/ws", ip, port);
        snprintf(WS_AUDIO_URI, sizeof(WS_AUDIO_URI), "ws://%s:%s/data/audio", ip, port);
        snprintf(OTA_URL, sizeof(OTA_URL), "http://%s:%s/ota/latest.bin", ip, port);
        snprintf(TELEMETRY_URL, sizeof(TELEMETRY_URL), "http://%s:%s/esp/telemetry", ip, port);


        ESP_LOGI("WiFiNVS", "Loaded Wi-Fi and Server Info:");
        ESP_LOGI("WiFiNVS", "SSID=%s  IP=%s:%s", ssid, ip, port);
        ESP_LOGI("WiFiNVS", "WS_CTRL_URI=%s", WS_CTRL_URI);

        wifi_init_sta(ssid, pass);
    } else {
        ESP_LOGW("WiFiNVS", "No saved Wi-Fi credentials");
    }
}

static const char *TAG_OTA = "OTA";

void perform_ota_update(void *pvParameters)
{
    ESP_LOGI(TAG_OTA, "Starting OTA update from: %s", OTA_URL);

    esp_http_client_config_t http_cfg = {
        .url = OTA_URL[0] ? OTA_URL : "http://0.0.0.0:0/ota/latest.bin",
        .timeout_ms = 30000,
        .keep_alive_enable = true,
    };

    esp_https_ota_config_t ota_cfg = {
        .http_config = &http_cfg,
    };

    esp_err_t ret = esp_https_ota(&ota_cfg);
    if (ret == ESP_OK) {
        ESP_LOGI(TAG_OTA, "OTA complete, shutting down safely in 2s...");
        vTaskDelay(pdMS_TO_TICKS(2000));
        esp_wifi_stop();
        esp_bt_controller_disable();
        vTaskDelay(pdMS_TO_TICKS(200));
        esp_restart();
    } else {
        ESP_LOGE(TAG_OTA, "OTA failed: %s", esp_err_to_name(ret));
    }

    vTaskDelete(NULL); 
}

static void telemetry_push_task(void *arg) {
    while (1) {
        if (!atomic_load(&wifi_connected)) {
            vTaskDelay(pdMS_TO_TICKS(2000));
            continue;
        }


        float temp = read_temperature_c();
        if (temp < -500.0f) temp = 0.0f; // guard if sensor unavailable

        char json[256];
        snprintf(json, sizeof(json),
                "{\"device_id\":\"speechster_b1_s3\",\"heap\":%u,\"frames_sent\":%" PRIu32 ",\"temp\":%.2f}",
                (unsigned)esp_get_free_heap_size(), frames_sent, temp);

        esp_http_client_config_t cfg = {
            .url = TELEMETRY_URL[0] ? TELEMETRY_URL : "http://0.0.0.0:0/esp/telemetry",
            .method = HTTP_METHOD_POST,
            .timeout_ms = 3000,
        };

        esp_http_client_handle_t client = esp_http_client_init(&cfg);
        esp_http_client_set_header(client, "Content-Type", "application/json");
        esp_http_client_set_post_field(client, json, strlen(json));
        esp_http_client_perform(client);
        esp_http_client_cleanup(client);

        vTaskDelay(pdMS_TO_TICKS(30000)); // every 10s
    }
}

/* init on-chip temperature sensor (ESP32-S3) */
static void init_temp_sensor(void)
{
    temperature_sensor_config_t cfg = TEMPERATURE_SENSOR_CONFIG_DEFAULT(10, 50);
    // Set reasonable sample cycles if API requires (default macro used above)
    esp_err_t rc = temperature_sensor_install(&cfg, &temp_sensor_handle);
    if (rc != ESP_OK) {
        ESP_LOGW(TAG, "temp_sensor install failed: %s", esp_err_to_name(rc));
        temp_sensor_handle = NULL;
        return;
    }
    rc = temperature_sensor_enable(temp_sensor_handle);
    if (rc != ESP_OK) {
        ESP_LOGW(TAG, "temp_sensor enable failed: %s", esp_err_to_name(rc));
        temperature_sensor_uninstall(temp_sensor_handle);
        temp_sensor_handle = NULL;
        return;
    }
    ESP_LOGI(TAG, "Temp sensor available");
}

/* safe read wrapper, returns -1000 on error */
static float read_temperature_c(void)
{
    if (!temp_sensor_handle) return -1000.0f;
    esp_err_t rc = temperature_sensor_get_celsius(temp_sensor_handle, &current_temp_c);
    if (rc != ESP_OK) {
        ESP_LOGW(TAG, "temp_sensor read error: %s", esp_err_to_name(rc));
        return -1000.0f;
    }
    return current_temp_c;
}

/* Small smoothing filter to reduce temperature jitter */
static float smooth_temp(float new_temp)
{
    static float avg = -10000.0f;
    if (avg < -9000.0f) avg = new_temp;
    avg = (avg * 0.8f) + (new_temp * 0.2f);
    return avg;
}


/* Thermal watchdog — auto-throttle radios and stop audio if needed */
static void thermal_watchdog_task(void *arg)
{
    while (1) {
        float t = read_temperature_c();
        t = smooth_temp(t);
        if (t > -100.0f) { // valid reading

            if (!wifi_stack_started) {
                ESP_LOGD("THERMAL", "Wi-Fi stack not started yet; skipping TX power adjust");
                vTaskDelay(pdMS_TO_TICKS(5000));
                continue;
            }

            esp_err_t rc = ESP_OK;

            if (t >= THERMAL_CRIT_C) {
                ESP_LOGE("THERMAL", "CRITICAL TEMP %.2f °C — stopping mic & throttling radios", t);
                stop_mic_streaming();
                rc = esp_wifi_set_max_tx_power(8);   // ~2 dBm
            } else if (t >= THERMAL_WARN_C) {
                ESP_LOGW("THERMAL", "High temp %.2f °C — throttling radios", t);
                rc = esp_wifi_set_max_tx_power(32);  // ~8 dBm
            } else {
                rc = esp_wifi_set_max_tx_power(40);  // ~10 dBm (nominal)
            }

            if (rc != ESP_OK)
                ESP_LOGW("THERMAL", "esp_wifi_set_max_tx_power rc=%s", esp_err_to_name(rc));
        } else {
            ESP_LOGD("THERMAL", "Temp read invalid, skipping thermal actions");
        }

        vTaskDelay(pdMS_TO_TICKS(5000)); // check every 5 s
    }
}

/* ─────────────────────────────────────────────
 *  DIE TEMPERATURE failsafe
 *  Final protection layer: BLE-priority emergency alert + full shutdown
 * ───────────────────────────────────────────── */
static void die_temperature_task(void *arg)
{
    const float DIE_TEMP_C = 75.0f;  // Persistent threshold
    static uint64_t above_start_ms = 0;

    while (1) {
        float t = read_temperature_c();
        if (t > -100.0f) {
            if (t >= DIE_TEMP_C) {
                uint64_t now = esp_timer_get_time() / 1000ULL;
                if (above_start_ms == 0)
                    above_start_ms = now;

                if ((now - above_start_ms) >= 1000) {  // ≥1s sustained
                    ESP_LOGE("DIE_TEMP", "🔥 DIE TEMPERATURE REACHED (%.2f °C)", t);
                    ESP_LOGE("DIE_TEMP", "Shutting down all subsystems...");

                    // 1️⃣ Kill active tasks first
                    stop_mic_streaming();
                    adc_stop();

                    // 2️⃣ Compose emergency message
                    const char *die_msg = "{\"msg\":\"Die Temps Reached\"}";

                    // 3️⃣ BLE first — must reach doctor ASAP
                    ble_send_json_response(die_msg);

                    // 4️⃣ Then Wi-Fi to backend for logging
                    if (atomic_load(&wifi_connected)) {
                        esp_http_client_config_t cfg = {
                            .url = TELEMETRY_URL[0] ? TELEMETRY_URL : "http://0.0.0.0:0/esp/telemetry",
                            .method = HTTP_METHOD_POST,
                            .timeout_ms = 2000,
                        };
                        esp_http_client_handle_t c = esp_http_client_init(&cfg);
                        esp_http_client_set_header(c, "Content-Type", "application/json");
                        esp_http_client_set_post_field(c, die_msg, strlen(die_msg));
                        esp_http_client_perform(c);
                        esp_http_client_cleanup(c);
                    }

                    // 5️⃣ Disable everything except radios

