SpeechsterInnovations/Speechster_ESP32-H2-Testing/Speechster-ESP32-S3-PR1/Main-Working/main/main.c
                    if (wifi_stack_started) {
                        esp_err_t rc = esp_wifi_stop();
                        ESP_LOGI("DIE_TEMP", "esp_wifi_stop rc=%s", esp_err_to_name(rc));
                        wifi_stack_started = false;
                    } else {
                        ESP_LOGW("DIE_TEMP", "Wi-Fi already stopped, skipping");
                    }
                    esp_bt_controller_disable(); // optional, leave if BLE alert confirmed


                    // 6️⃣ Log and sleep forever
                    ESP_LOGE("DIE_TEMP", "System entering deep shutdown to prevent damage.");
                    vTaskDelay(pdMS_TO_TICKS(100)); // small delay to flush UART

                    // Disable all wake sources to make shutdown permanent until power-cycle
                    esp_sleep_disable_wakeup_source(ESP_SLEEP_WAKEUP_ALL);
                    esp_deep_sleep_start();  // full power-off
                }
            } else {
                above_start_ms = 0;  // reset counter once cooled
            }
        }
        vTaskDelay(pdMS_TO_TICKS(200)); // poll 5×/s for responsiveness
    }
}


/* ----------------------- PM: helper to enable dynamic scaling (call once) ----------------------- */
static void setup_power_management(void)
{
#ifdef CONFIG_PM_ENABLE
    // On S3 the esp_pm_config_t struct is available; falling back to esp_pm_config_t works on many IDF versions.
    // We'll use esp_pm_config_t as in your existing code but set light sleep enabled.
    esp_pm_config_t pmcfg = {
        .max_freq_mhz = SPEECHSTER_PM_MAX_MHZ,
        .min_freq_mhz = SPEECHSTER_PM_MIN_MHZ,
        .light_sleep_enable = true
    };
    esp_err_t rc = esp_pm_configure(&pmcfg);
    if (rc != ESP_OK) {
        ESP_LOGW(TAG, "esp_pm_configure failed: %s", esp_err_to_name(rc));
    } else {
        ESP_LOGI(TAG, "PM configured %u-%u MHz, light sleep enabled", SPEECHSTER_PM_MIN_MHZ, SPEECHSTER_PM_MAX_MHZ);
    }
#else
    ESP_LOGW(TAG, "Power management not enabled in sdkconfig");
#endif
}

static void print_b1_banner() {

        // Hide cursor for cinematic effect
    printf("\033[?25l");

    // Cyan → White → Magenta gradient using precomputed ANSI 24-bit colors
    printf("\n");
    printf("\033[38;2;0;200;255m═══════════════════════════════════════════════════════════════\033[0m\n");
    
    vTaskDelay(pdMS_TO_TICKS(50));

    printf("\033[38;2;0;200;255m║\033[0m");
    vTaskDelay(pdMS_TO_TICKS(50));
    printf("                        \033[38;2;255;255;255mSPEECHSTER-B1\033[0m");
    vTaskDelay(pdMS_TO_TICKS(50));
    printf("                       \033[38;2;255;100;200m║\033[0m\n");
    vTaskDelay(pdMS_TO_TICKS(50));

    printf("\033[38;2;0;200;255m║\033[0m");
    vTaskDelay(pdMS_TO_TICKS(50));

    printf("            \033[38;2;255;150;230m“Where overheating meets overengineering.”\033[0m");
    vTaskDelay(pdMS_TO_TICKS(50));

    printf("       \033[38;2;255;100;200m║\033[0m\n");
    vTaskDelay(pdMS_TO_TICKS(50));


    printf("\033[38;2;255;120;255m═══════════════════════════════════════════════════════════════\033[0m\n\n");
    vTaskDelay(pdMS_TO_TICKS(50));

    // Restore cursor visibility
    printf("\033[?25h");
}

static void ws_manager_task(void *arg)
{
    ws_action_t act;
    while (1) {
        if (xQueueReceive(ws_mgr_q, &act, portMAX_DELAY) == pdTRUE) {
            switch (act) {
                case WS_ACTION_STOP_CTRL:
                    if (ws_client_ctrl) {
                        esp_websocket_client_stop(ws_client_ctrl);
                    }
                    break;
                case WS_ACTION_DESTROY_CTRL:
                    if (ws_client_ctrl) {
                        // must stop then destroy
                        esp_websocket_client_stop(ws_client_ctrl);
                        vTaskDelay(pdMS_TO_TICKS(20)); // tiny breathing room
                        esp_websocket_client_destroy(ws_client_ctrl);
                        ws_client_ctrl = NULL;
                        atomic_store(&ws_ctrl_connected, false);
                    }
                    break;
                case WS_ACTION_STOP_AUDIO:
                    if (ws_client_audio) {
                        esp_websocket_client_stop(ws_client_audio);
                    }
                    break;
                case WS_ACTION_DESTROY_AUDIO:
                    if (ws_client_audio) {
                        esp_websocket_client_stop(ws_client_audio);
                        vTaskDelay(pdMS_TO_TICKS(20));
                        esp_websocket_client_destroy(ws_client_audio);
                        ws_client_audio = NULL;
                        atomic_store(&ws_audio_connected, false);
                    }
                    break;
                default:
                    break;
            }
        }
    }
}


/* ---------- app_main ---------- */
void app_main(void) {
    esp_log_set_vprintf(vprintf);
    esp_log_level_set("*", ESP_LOG_INFO);

    esp_log_level_set("NimBLE", ESP_LOG_ERROR);
    esp_log_level_set("I2S_CAP", ESP_LOG_DEBUG);

    esp_err_t esp_brownout_disable(void);
    esp_brownout_disable();


    ESP_LOGI(TAG, "Speechster B1 Starting Up");

    // Mutexes and basic prealloc
    state_lock = xSemaphoreCreateMutex();
    ringbuf_mutex = xSemaphoreCreateMutex();
    if (!state_lock || !ringbuf_mutex) {
        ESP_LOGE(TAG, "Failed to create mutexes");
        return;
    }

    // --- Preallocate DMA Buffers ---
    // Ensure DMA buffer is at least the I2S read size (I2S_BUF_SIZE)
    const size_t frame_sample_bytes = ((AUDIO_SAMPLE_RATE / 1000) * AUDIO_FRAME_MS) * sizeof(int32_t);
    const size_t required_bytes = MAX(frame_sample_bytes, (size_t)I2S_BUF_SIZE);

    i2s_dma_buf = heap_caps_malloc(required_bytes, MALLOC_CAP_DMA);
    if (!i2s_dma_buf) {
        ESP_LOGE(TAG, "Failed to alloc I2S DMA buffers (need %u bytes)", (unsigned)required_bytes);
        return;
    }

    ctrl_queue = xQueueCreate(CTRL_QUEUE_LEN, sizeof(control_msg_t));
    // pointer-based queue now (each item = pointer to wifi_frame_t)
    wifi_send_q = xQueueCreate(WIFI_SEND_QUEUE_LEN, sizeof(wifi_frame_t *));

