SpeechsterInnovations/Speechster_ESP32-H2-Testing/Speechster-ESP32-S3-PR1/Main-Working/main/main.c
    if (!ctrl_queue || !wifi_send_q) {
        ESP_LOGE(TAG, "Queue alloc failed");
        return;
    }

    // --- Init NVS early for Wi-Fi / BLE ---
    esp_err_t ret = nvs_flash_init();
    if (ret == ESP_ERR_NVS_NO_FREE_PAGES || ret == ESP_ERR_NVS_NEW_VERSION_FOUND) {
        ESP_ERROR_CHECK(nvs_flash_erase());
        ESP_ERROR_CHECK(nvs_flash_init());
    }

    // --- Bring up BLE first ---
    init_nimble();

    // Create WS manager queue early so event callbacks can enqueue safely
    ws_mgr_q = xQueueCreate(8, sizeof(ws_action_t));
    if (!ws_mgr_q) {
        ESP_LOGE(TAG, "ws_mgr_q create failed");
    } else {
        xTaskCreate(ws_manager_task, "ws_mgr", 4096, NULL, 5, NULL);
    }


    // --- Now Wi-Fi (loads from NVS or BLE JSON later) ---
    loadNVSData();

    // ─── Power / PM setup ──────────────────────────────────────
    setup_power_management();
    xTaskCreatePinnedToCore(dynamic_pm_task, "pm_adapt", 4096, NULL, 2, NULL, 1);

    // ─── Temperature sensor init ───────────────────────────────
    init_temp_sensor();

    // ─── Core assignments ──────────────────────────────────────

    // Core 0 → network / control / light sensors
    xTaskCreatePinnedToCore(control_task, "ctrl_task", 6144, NULL, 5, NULL, 0);
    xTaskCreatePinnedToCore(wifi_send_task, "wifi_send", 8192, NULL, 4, NULL, 0);
    xTaskCreatePinnedToCore(pSensor_task, "pSensor", 4096, NULL, 3, NULL, 0);

    // Core 1 → audio / power / thermal / telemetry
    
    // Capture and store the task handle so notify_i2s_start/stop work
    if (xTaskCreatePinnedToCore(i2s_capture_task, "i2s_cap", 20*1024, NULL, 5, &i2s_task_handle, 1) != pdPASS) {
        ESP_LOGE(TAG, "Failed to create i2s_capture_task");
        i2s_task_handle = NULL;
    }
    xTaskCreatePinnedToCore(thermal_watchdog_task, "thermal_wd", 4096, NULL, 3, NULL, 1);
    xTaskCreatePinnedToCore(die_temperature_task, "die_temp", 4096, NULL, 5, NULL, 1);
    xTaskCreatePinnedToCore(telemetry_push_task, "telemetry_push", 4096, NULL, 3, NULL, 1);

/*    // --- Spawn mic test only after I²S fully ready ---
    vTaskDelay(pdMS_TO_TICKS(500));  // give time for I²S and DMA init
    if (rx_chan) {
        ESP_LOGI("DBG", "Spawning mic_test_task_debug (I²S ready)");
        xTaskCreate(mic_test_task_debug, "mic_debug", 4096, NULL, 5, NULL);
    } else {
        ESP_LOGE("DBG", "Skipping mic debug — rx_chan not initialized");
    } */

    vTaskDelay(pdMS_TO_TICKS(300));
    printf("\033[2J\033[H");  // Clear screen
    print_b1_banner();
    
    ESP_LOGI(TAG, "Build %s (%s) — IDF %s", __DATE__, __TIME__, esp_get_idf_version());
}